[
    {
        "file_name": "1702861677MICROSOFT-OFFICE-BOOK.pdf",
        "content": "Table of Contents\nA New Look ............................................................................................................................................. 2\nThe W Button .......................................................................................................................................... 3\nThe Minimize Ribbon Button ................................................................................................................... 4\nThe File Tab ............................................................................................................................................. 5\nThe Quick Access Toolbar ........................................................................................................................ 6\nThe Ribbon .............................................................................................................................................. 7\nThe Help Button ...................................................................................................................................... 8\nCreate a Document ................................................................................................................................. 9\nSpelling and Grammar Mistakes ............................................................................................................ 10\nParagraph and Text Formatting ............................................................................................................. 11\nOpen an Existing File ............................................................................................................................. 13\nSaving Files Part I ................................................................................................................................... 14\nSaving Files Part II .................................................................................................................................. 15\nFile Tab with Recent Option ................................................................................................................... 16\nThe File Tab with Print Option ............................................................................................................... 17\nFile Tab Save & Send Option .................................................................................................................. 18\nFile Tab Help Option .............................................................................................................................. 19\nFile Tab Options Option ......................................................................................................................... 20\nThe Insert Tab ....................................................................................................................................... 21\nPage Layout Tab .................................................................................................................................... 22\nReferences Tab ...................................................................................................................................... 23\nMailings Tab .......................................................................................................................................... 24\nReview and View Tabs ........................................................................................................................... 25\nCreating a document to be used by previous versions of Word .............................................................. 26\nThe CutePDF Writer Addition ................................................................................................................ 27\n1\nA New Look\nIn Word 2010, there have been some features that are new or have been re-added and some features\nthat have been removed from past versions of Word. The biggest visual change has been the\nreplacement of the Office 2003 Command Line (File Edit View Insert…) for The Ribbon. The Office\nButton in Office 2007 has gone away and replaced by the File Tab. These features will be described in\nthe following pages.\nThe ‘W’ Button The Ribbon The Help Button\nThe Quick Access Toolbar\nThe File Tab The Minimize Ribbon Button\n2\nThe W Button\nThis button was removed in Office 2007 and makes its return in 2010. This button is convenient in that\nyou can Minimize, Maximize or Close Word without having to traverse your mouse across the entire\nscreen to the right corner to perform these same actions. With our monitors getting larger, this is a nice\nfeature.\n3\nThe Minimize Ribbon Button\nWhile reading over a document, it may be convenient at times to minimize the Ribbon. To minimize, just\nclick on the ‘up arrow’ symbol.\nTo maximize the Ribbon, click on the ‘down arrow’ symbol.\n4\nThe File Tab\nThe File tab is basically the same look as the File command for Office 2003 users. You will still see the\nsame commands such as, Save, Save As, New, Print, etc. For Office 2007 users, the Office Button has\ngone away and has been replaced by the File tab. Here, you will still find the basic file commands. The\nscreen below is the default with Info being highlighted in the left column and the right side giving you\nmore information about your document like file size, number of words and pages.\n5\nThe Quick Access Toolbar\nThe Quick Access Toolbar is located in the upper left corner and is intended to store the buttons you will\nuse most often.\nBy default, the Quick Access Toolbar shows the Save, Undo, and Redo buttons, however if you click on\nthe drop down arrow just to the right, you can customize it to fit your needs. In the example below, I\nhave added the Quick Print button. The Save icon (which appears as a floppy diskette symbol) is\nconvenient to click on when wanting to save your work instead of clicking on the Save icon from the File\ntab.\n6\nThe Ribbon\nThe Ribbon is designed to replace the menus and toolbars of Office 2003. The goal of the Ribbon is to\nkeep commands visually up front so that they are easy to access as you work.\nThe Ribbon is divided into what are called Groups (Clipboard, Font, Paragraph and Styles, etc.). Each\nGroup has a triangular icon in the lower right hand corner. Clicking this will bring up an additional menu\nwindow. For example, clicking the triangle in the Font group brings up the classic Font options window.\nYou will find that most\nof your needs can be\nfound right on the\nRibbon Group itself.\n7\nThe Help Button\nThere is so much that Word can do in the latest version that it’s hard to know everything. If you want\ninformation on a topic, click on the ‘?’ symbol in the upper right hand corner and the Help window will\nappear like below. You will see common topics to click on or you can type in a word or question in the\nsearch field to find further information.\n8\nCreate a Document\nGetting started with a basic document in Microsoft Word 2010 is as easy as opening Word and\nbeginning to type. Or, if you want to create an additional document besides the one you already have\nopened, click on the File tab, click on New in the left column, then double click on Blank document and\na new document window will appear.\nYou can also start a document from a template from the New view as well. There are many to download\nand choose from if you are on the Internet from Office.com like Letters, Flyers and Forms. If there is no\nInternet connection, you may choose from the Sample templates under Available Templates.\n9\nSpelling and Grammar Mistakes\nAs you type, Word will warn you if make spelling or grammar mistakes by inserting a wavy red, green, or\nblue underline beneath the text that it thinks is an error. Red underline: This indicates either a possible\nspelling error or that Word doesn’t recognize a word, such as a proper name or place. Green underline:\nWord thinks that grammar should be revised. Blue underline: A word is spelled correctly but does not\nseem to be the correct word for the sentence. For example, you type “too,” but the word should be\n“to.”\nYou right click an underlined word to see the suggested revisions. Click a revision to replace the word in\nthe document and get rid of the underlines.\nA note of caution about green and blue underlines: Word is really good at spelling, which is pretty\nstraightforward most of the time. But grammar and correct word usage take some judgment.\nIf you think that you are right, and Word is wrong, then you can right-click the word and ignore the\nsuggested revisions and get rid of the underlines.\n10\nParagraph and Text Formatting\nWord 2010 assumes some defaults when you start a new document. For instance, there is no\nindentation on paragraphs and the line or sentence spacing is set by the default Style called Normal.\nLine Spacing (the space\nbetween each sentence) can\nbe tightened up by choosing\nthe No Spacing option on the\nStyles group.\nIf Indentation is needed, click\nthe triangle on the Paragraph\ngroup. Under Indentation,\nSpecial, choose First Line.\nParagraphs can have Bullets\nor Numbering added. Hover\nthe cursor over any button\nproduces a description.\nClicking the button will\nexecute the feature.\n11\nText alignment is also available on the Paragraph group. The default is Align Text Left which is\nhighlighted. The other options are Center, Align Text Right and Justify which is a clean look with text\naligned on both margins.\nText can easily be color highlighted or colored. Highlight the text first with your cursor then click on the\nFont Color button and the text will change to the default of red. To change the font color, click on the\ndown arrow for the color palette and choose your color. To color highlight your text, highlight the text\nwith your cursor, click on the Text Highlight Color button and it changes to the default of yellow. To\nchange the highlight color, click on the down arrow for the color palette and choose your color.\n12\nOpen an Existing File\nTo open an existing file you’ve created, click on the File tab, click the Open button and the familiar Open\ndialog box appears as seen in the next screen shot below.\nClick on the file you want, then click Open at the bottom right.\n13\nSaving Files Part I\nWhile editing an existing file, it’s a good habit to often save your work. There are two different ways to\nsave files. Click the File tab, then just click the Save button. The faster option as described earlier, is to\nclick the Save button in the Quick Access Toolbar.\n14\nSaving Files Part II\nWhen editing an existing document, you may want to save the file under a different name. Click on the\nFile tab, click the Save As button and the Save As dialog box opens as seen below. In the File name field,\ntype in the new name without changing the .docx extension. Click the Save button.\n15\nFile Tab with Recent Option\nThe Recent option on the File tab allows you to quickly go to your other documents and open them. If\nyou accidently deleted a document or closed Word by mistake, you can recover your documents by\nclicking on the Recover Unsaved Documents button at the bottom of the page.\n16\nThe File Tab with Print Option\nThe Print option will be one of the most common choices on the File tab. The example below shows\nsome nice features. Here you can choose Orientation for Potrait or Landscape jobs, Double sided\nprinting, Paper Size, etc. When choosing Print with previous Word versions, the Print dialog box would\nopen and you need to click on Properties to find these needs. With this default Print window, all these\nchoices are listed plus others! If you want to print a particular page, ensure you are on that page, click\non the File tab, then click on Print All Pages for the drop down menu and select Print Current Page. If\nyou have more than one printer, click on the button under Printer for the drop down menu, and select\nyour printer.\nIf there are no special requirements, you just click on the square Print box in the upper left corner.\n17\nFile Tab Save & Send Option\nThere is a nice email feature on the Save & Send option under the File tab. You can choose to send your\ndocument as an email attachment. Clicking the Send as Attachment button causes a new Outlook email\nbox to open with your Word file attached! You can also choose to send it as a PDF file by clicking the\nSend as PDF button. You may also choose to save your document as a PDF file by clicking the Create\nPDF/XPS Document button.\n18\nFile Tab Help Option\nYou may also find Help with Word 2010 under the File tab. Clicking the Getting Started button offers\nnice videos on basics for all the Office suite programs from Microsoft.com. The Microsoft Office Help\nbutton offers the same useful help information as the question mark symbol in the upper right corner.\nYou can also see which version of Word is loaded on this view.\n19\nFile Tab Options Option\nYou can customize many tools and features in Word by clicking on the Options button. For example, you\ncan change the color scheme under the General button on the dialog box that opens in the screen shot\nseen below. Changes can also be made for Display, Proofing and how files can be saved.\n20\nThe Insert Tab\nThe Insert Tab offers many tools that can add nice features to a document.\nPictures or drawings can be added by clicking on the Picture button. A The Insert Picture box will open\nprompting you to browse to the picture on your PC. Click the picture you want then click Insert. It will\nappear on your document.\nClipart are pictures or illustrations that can be added through the Internet from Office.com. Simply click\nthe Clipart button and a dialog box will appear. Type in the subject in the ‘Search for:’ field, click the box\nfor ‘Include Office.com content’ and then click the Go button. Click the picture you want from the results\nthat appeared and it will be inserted into your document.\nShapes like lines, arrows, basic geometric shapes, equation shapes, flowchart shapes, stars, and banners\ncan be added. Clicking the Shapes button will cause a large dropdown of multiple shapes to appear.\nClick your choice, and then click your cursor on the document where you want, and the shape will\nappear.\nCharts can also be added to a document. There are many to choose from such as column charts, line\ngraphs, pie charts, bar charts, area graphs, and stock charts. Click on the Chart button and the Insert\nChart box will appear. Select the type of chart on the left, select the chart on the right, click OK and the\nchart will appear and it then can be manipulated.\nHeaders, Footers and Page Numbers can also be added to a document from the Header & Footer group\non the Insert Ribbon. For a multi-page document, the content of the Header will be seen at the top of\neach printed page and the Footer will be seen at the bottom as well as the page number when added.\nThese are just a few common examples on the Insert tab. The size of your object can also be changed.\nAfter you add the object, a box appears around it with circles in each corner. Hover your cursor over the\nbottom right circle until the arrow appears, hold the left mouse button and just move your mouse!\n21\nPage Layout Tab\nThe Page Layout Tab lets you control the look and feel of a document in Microsoft Word 2010. You can\napply a global design to your document by using one of the available themes and color schemes.\nThe margins can be controlled on your document giving you smaller or greater size in which to work.\nJust click on Margins, and just click on the desired choice of options.\nClick on Orientation for Portrait or Landscape layout.\nPage Color and Page Borders can be added from the Page Background group.\nAs you may notice, the Page Layout tab has some of the same commands that you will find on the Home\ntab like Indentation, Spacing and Line Numbering.\nThe Page Setup group has the triangle button at the bottom right in which to click and see the more\nadvanced Page Setup options. The Paragraph group also has the triangle button for the advanced box\nlike it does on the Home tab.\n22\nReferences Tab\nThe References Tab on Microsoft Word 2010's ribbon offers a quick way to enter your document\nsources, citations etc. On the References tab you will find groups like Table of Contents, Footnotes,\nCitations & Bibliography, and Captions.\nOne of the nicest features on the References tab is adding the Table of Contents for a document. One\nthing you need to make sure is that you type your document using one of the heading styles for the\nitems that need to be included in the Table of Contents. Click the Table of Contents button and the table\nbelow appears. Automatic Table 2 is a good choice. Click this option and your table is created!\n23\nMailings Tab\nOne of the most common features on the Mailings tab is the Envelopes and Labels for printing.\nClicking the Envelopes button produces the box below which allows you to enter in the Delivery address\nand Return address. Clicking the Options button gives the choices for the envelope size. On the Labels\ntab, the Options button is also available for the needed label size.\n24\nReview and View Tabs\nThe Proofing group is one of the most popular groups on the Review tab.\nOnce you have finished your document, you can perform one last spell check by choosing the Spelling &\nGrammar button. This is an automated process going through the entire document.\nThe Research button will allow you to access different dictionary lookups of any word you have\nhighlighted.\nThe Thesaurus button will suggest other words with a similar meaning for the word you have\nhighlighted.\nThe Word Count button will give you statistics for the number of pages, words, paragraphs, lines, etc.\nView Tab\nThe View Tab is the last of the tabs on the Microsoft Word 2010 Ribbon.\nBy the buttons available on the Document Views group, you can view your document in different ways.\nYou can see the Print Layout, Full Screen Reading, Web Layout, Outline, and Draft views.\nOn the Show group, you can measure and line up objects by clicking the Ruler button and the ruler will\nappear at the top and left margin of the document.\nThe Gridlines button also allows you to line up objects by splashing a grid paper view on top of the\ndocument.\n25\nCreating a document to be used by previous versions of Word\nIf you create a document to send to people who are working in earlier versions of Word and you know\nthat they have installed the Microsoft Office Compatibility Pack for Word, Excel, and PowerPoint 2007\nFile Formats, you can work in Microsoft Word 2010 mode.\nIf you aren't sure whether the people you send your document to have installed the Microsoft Office\nCompatibility Pack for Word, Excel and PowerPoint Open XML File Formats, you can work in\nCompatibility Mode. Compatibility Mode makes sure that no new or enhanced features in Word 2010\nare available while you work in a document, so that people who are using previous versions of Word will\nhave full editing capabilities.\nNote: If you already created a document, and you want to find out what content won't be available for\nediting in earlier versions, see Features that behave differently in earlier versions.\nTurn on Compatibility Mode\nWhen you create a new document that will be used in an earlier version, you can turn on Compatibility\nMode by saving the file in Word 97-2003 format.\n1. Open a new document.\n2. Click the File tab.\n3. Click Save As.\n4. In the Save as type list, click Word 97-2003 Document. This changes the file format to .doc.\n5. In the File name box, type a name for the document.\n6. Click Save.\n26\nThe CutePDF Writer Addition\nWith the deployment of all new staff computers, there will be a program loaded called CutePDF Writer.\nThe purpose of this program is to allow you to create PDF files from any Windows program that is able\nto print. If you needed to send a document to someone who doesn’t have Word or a compatible\nversion, this is the answer for everyone has access to Adobe Reader. To create the PDF document from\nWord, click on the Print button from the File tab. From the drop down menu under Printer, choose\nCutePDF Writer, then click the Print button. The Save As box below appears. You can save the converted\nPDF to your PC!\n27\n\n\nMS EXCEL\nA spreadsheet is essentially a matrix of rows and columns.\nConsider a sheet of paper on which horizontal and vertical lines are\ndrawn to yield a rectangular grid. The grid namely a cell, is the result\nof the intersection of a row with a column. Such a structure is called a\nSpreadsheet.\nA spreadsheet package contains electronic equivalent of a pen,\nan eraser and large sheet of paper with vertical and horizontal lines to\ngive rows and columns. The cursor position uniquely shown in dark\nmode indicates where the pen is currently pointing. We can enter text\nor numbers at any position on the worksheet. We can enter a formula\nin a cell where we want to perform a calculation and results are to be\ndisplayed. A powerful recalculation facility jumps into action each time\nwe update the cell contents with new data.\nMS-Excel is the most powerful spreadsheet package brought by\nMicrosoft. The three main components of this package are\n(cid:1) Electronic spreadsheet\n(cid:1) Database management\n(cid:1) Generation of Charts.\nEach workbook provides 3 worksheets with facility to increase the\nnumber of sheets. Each sheet provides 256 columns and 65536 rows\nto work with. Though the spreadsheet packages were originally\ndesigned for accountants, they have become popular with almost\neveryone working with figures. Sales executives, book-keepers,\nofficers, students, research scholars, investors bankers etc, almost any\none find some form of application for it.\nYou will learn the following features at the end of this section.\n(cid:1) Starting Excel 2003\n(cid:1) Using Help\n(cid:1) Workbook Management\n(cid:1) Cursor Management\n(cid:1) Manipulating Data\n(cid:1) Using Formulae and Functions\n(cid:1) Formatting Spreadsheet\n(cid:1) Printing and Layout\n(cid:1) Creating Charts and Graphs\nMS Excel Page 1 of 40\nStarting Excel 2003\n(cid:1) Switch on your computer and click on the Start button at the\nbottom left of the screen.\n(cid:1) Move the mouse pointer to Programs, then across to\nMicrosoft Excel, then click on Excel as shown in this screen.\n(cid:1) When you open Excel a screen similar to this will appear\nMS Excel Page 2 of 40\n(cid:1) The options shown below is called as Menu Bar\n(cid:1) The collection of icons for common operations shown below\nis called as Standard Tool Bar\nMS Excel Page 3 of 40\nMS Excel Page 4 of 40\n(cid:1) The formula bar is the place in which you enter the\nformula(=A3*B5)\n(cid:1) The alphabets A,B… are known as columns\nMS Excel Page 5 of 40\n(cid:1) This is the name of the workbook. (Book1)\n(cid:1) The rows are numbered as 1,2,3…\n(cid:1) Sheet1,Sheet2, Sheet3 are known as worksheet tabs\nHow to use Help Menu\n(cid:1) Click on Help, Contents and Index, then click on the Index\ntab. The following screen will appear\nMS Excel Page 6 of 40\n(cid:1) Type the first few letters to see the help entries for those letters.\n(cid:1) You can get the printout of any help topic by selecting it, right\nclicking and then clicking Print Topic.\nWorkbook Management\nTask 1: Creating a new workbook\n(cid:1) Click on File menu and then click on New.\n(cid:1) Click Workbook and then click OK button. You will get the\nscreen as shown below.\nMS Excel Page 7 of 40\n(cid:1) Enter data as shown in the figure below :\nMS Excel Page 8 of 40\nTask 2: Saving Workbook\n(cid:1) Click on File menu and then click save. You will get the below\nscreen\n(cid:1) In the File name text box, type sample and then click Save\nbutton\nTask 3: Opening an existing workbook\n(cid:1) Click on the File menu and click on Open. The open dialog box\nwill appear\nMS Excel Page 9 of 40\n(cid:1) Click on some file (Example: sample.xls), then click on Open.\nTask 4: Closing your workbook\n(cid:1) Click on File menu, then click Close to close your workbook\nCursor Management\nTask 1: Moving around the worksheet\n(cid:1) Open sample.xls workbook.\n(cid:1) Move the cursor in your worksheet by using the arrow keys on\nthe right-hand side of the keyboard.\n(cid:1) When you have got lots of rows of data you can move the cursor\nmore quickly by using the PgUp and PgDn keys to move up and\ndown a screen at a time.\n(cid:1) To move one screen to the right, press the Alt key and PgDn\nkeys together.\n(cid:1) To move one screen to the left, press the Alt and PgUp keys\ntogether.\n(cid:1) To move further to the right, just keep pressing the right arrow\nkey\n(cid:1) To move back to cell A1, press the Ctrl and Home keys\ntogether.\n(cid:1) Pressing the Home key on its own takes you back to column A\n(cid:1) To move to the last column(IV) press the Ctrl and right arrow\nkeys together.\nMS Excel Page 10 of 40\n(cid:1) To move to last cell containing data, press Ctrl and End keys\ntogether.\n(cid:1) To move to the last row(65,536), press Ctrl and the down\narrow keys together.\n(cid:1) You can also move the cursor with the mouse. Move the mouse\npointer to the location you want. Press and release the left\nmouse button once when the cursor is where you want it.\nTask 2: Moving to a Specified cell\n(cid:1) Click on the Edit menu, choose Go To. You will get the below\nscreen\n(cid:1) Enter the destination cell reference in the Reference text box.\n(cid:1) Click OK to move directly to the specified cell.\nData Manipulation\nTask 1: Entering data\n(cid:1) Start Excel. Click File and then New. An empty worksheet\nappears as shown below\nMS Excel Page 11 of 40\n(cid:1) Type Expenditure in cell A1 then press down arrow key to move\nto cell A2.\n(cid:1) Type Month then press the down arrow key to move to cell A3\n(cid:1) Continue to type the data. The resulting worksheet should\nappear like the following screen.\nMS Excel Page 12 of 40\n(cid:1) Save your work by clicking File and then Save As. This dialog\nbox appears.\n(cid:1) Type cash in the File Name text box and then click Save button.\nExcel automatically adds the extension .xls to your file name.\nMS Excel Page 13 of 40\nTask 2: Editing data\n(cid:1) Click File and then click Open.\n(cid:1) Click cash.xls and then click Open.\n(cid:1) Move the mouse pointer to cell D4, click and release. The cell is\nhighlighted and 18 appears in the formula bar.\n(cid:1) Move the mouse pointer to the formula bar and click once to the\nright of 18.\n(cid:1) Use the Backspace key to delete 8,then type 4 and press\nEnter. Cell D4 now contains the value 14.\nTask 3: Replacing cell data\n(cid:1) Make the cell B5 active by clicking on it.\n(cid:1) Type 200 and press Enter. The cell B5 will now contain the value\n200 replacing old value (150).\nTask 4: Deleting cell contents\n(cid:1) Move to cell C5 and click to select.\n(cid:1) Press the Delete key.\n(cid:1) The cell becomes blank.\nMS Excel Page 14 of 40\n(cid:1) Drop down the Edit menu and click Undo to reinstate the 145.\nExcel 97 allows 16 levels of undo. You can use Undo and Redo\nbuttons also.\nTask 5: Copying data\n(cid:1) Open the cash spreadsheet.\n(cid:1) Select the cells D3 to D5\n(cid:1) Click Edit menu and then click Copy.\n(cid:1) Select the cells F3 to F5.\n(cid:1) Click Edit menu and then click Paste.\n(cid:1) Now the cells D3 to D5 are copied into F3 to F5.\nTask 6: Moving data\n(cid:1) Open cash.xls spreadsheet.\n(cid:1) Select the cells from B3 to B5.\n(cid:1) Click Edit menu and then click Cut.\n(cid:1) Select the cells G3 to G5.\n(cid:1) Click Edit menu and then click Paste.\nTask 7: Data Auto Fill\nThere is an easy method to fill the data in columns and rows. The\ndata may be Numeric or dates and text.\nTo fill Slno by using auto fill\n¤ Type Slno for 2 cells i.e 1,2 in the cells A1 and A2 respectively.\n¤ Select two cells and drag the Fill Handle ++++\nTo fill dates in the cells\nMS Excel Page 15 of 40\n¤ Type date in the cell\n¤ Select the cell and drag the Fill Handle\nWe can customize the lists with different text data to minimize the\nredundancy of work.\nSome of the lists are listed below:\n1. Jan, Feb, Mar, Apr, May, June, July…. like months\n2. Sunday, Monday, Tuesday, Wednesday, Thursday…Like week\ndays\n3. Adilabad, Anatapur, Chittor, Cuddapah… like District names\n4. Ravi, Kiran, Praveen, Rama…. like employees list\nTo create a customized list follow the steps given below:\n¤ Click Tools Menu ,Click Options then click Custom Lists tab, Then\nyou will find the figure given below:\nMS Excel Page 16 of 40\n¤ Click NEW LIST and enter the list in the List entries window\n¤ Click Add button then click OK button then your list will be\nadded to the Custom Lists. That list you can use as and when\nrequired to type.\n¤ Now you can Drag the fill handle (+ ) to get the list\nautomatically.\nUsing Formulae and Functions\nTask 1: Entering a formulae\n(cid:1) Click File and then click New.\n(cid:1) Enter the data in the new worksheet as shown below\nMS Excel Page 17 of 40\n(cid:1) Cell B6 should contain formula. Move the cell pointer to cell B6.\n(cid:1) Type =B3+B5(formulae and functions should always begin with\n= sign)\n(cid:1) Cell B6 will now contain the value 350\n(cid:1) Look at cell B6; you will see the result of the formula in the cell\nB6 rather than formula.\n(cid:1) Now repeat the appropriate formula for cell C6, D6.\n(cid:1) Save your worksheet as cash3.xls.\nTask 2: Editing Formulae\n(cid:1) Move the cursor to the formula bar with the mouse, clicking\nonce.\n(cid:1) Make the desired changes.\n(cid:1) When you have finished editing the formulae, press the Enter\nkey for the changes to take effect.\n(OR)\n(cid:1) Edit the contents by pressing F2 key on the keyboard\nTask 3: Displaying and Printing formulae\n(cid:1) Click Tools menu and then click Options.\n(cid:1) Click View tab.\n(cid:1) In Window options check Formulas check box. The below\nscreen appears.\nMS Excel Page 18 of 40\n(cid:1) Click OK button.\n(cid:1) To print the worksheet with formulae displayed, click File menu\nand click on Print Preview. If the layout is satisfactory, click on\nthe Print button.\nTask 4: Using the SUM function\n(cid:1) Open cash3.xls spreadsheet.\n(cid:1) Suppose if you want the summation of the cells B3 to B5 should\nappear in the cell B6, then first select the cells from B3 to B6.\nMS Excel Page 19 of 40\n(cid:1) Click the Auto Sum icon on the toolbar.\n(cid:1) The result of (B3+B4+B5) will appear in the cell B6.\nTask 4: Copying Formulae\n(cid:1) Open cash3.xls spreadsheet.\n(cid:1) If you want to copy the formula in the cell B6 to C6,D6,E6 then\nfirst select the cell B6.\n(cid:1) Move the cursor to the lower right corner of the cell B6. The\ncursor will change to + icon.\n(cid:1) Drag the cursor from B6 to E6 and release left mouse button.\n(cid:1) You will notice that the cells C6, D6 and E6 are updated\nimmediately as shown below.\nTask 5: Copying formulae using absolute addressing\n(cid:1) Create the worksheet shown below and save ABS\n(cid:1) If you copy the formula in the cell c2 to c3, c4, c5 you will get\nthe incorrect\nMS Excel Page 20 of 40\n(cid:1) result because the formula will change in the cell (C3)to B3*A10\nbut the value in the A10 is not defined. The reason is that we are\ncopying relative address but not absolute address. To use\nabsolute address move to c2 cell.\n(cid:1) Edit the formula to =B2+($B$2*$A$9) and press Enter key.\n(cid:1) Copy the formula to cells C3 to C5.\nFormatting Spreadsheet\nMS Excel Page 21 of 40\nTask1: Increasing column width\n(cid:1) Open an existing worksheet(For example cash3.xls)\n(cid:1) Move the mouse pointer to the position(column B)shown below\nin the column header. When the black cross appears, hold down\nthe left button and drag the mouse to the right to increase the\ncolumn width by the required amount.\nTask 2: Decreasing column width\n(cid:1) Open cash3.xls spreadsheet.\n(cid:1) Move the mouse pointer to the column B. When the black cross\nappears, hold down the left button and drag the mouse to the\nleft to reduce the cell width.\nTask 3: Changing width of all cells in a spreadsheet\nMS Excel Page 22 of 40\n(cid:1) Open cash3.xls spreadsheet\n(cid:1) Select the entire worksheet by clicking the Select All button (to\nthe left of A1 cell) at the top left corner of the worksheet. The\nworksheet changes from white to black.\n(cid:1) Click Format menu, click Column, then click Width\n(cid:1) In the column width text box type 20, then click OK button. Your\nworksheet cells should all increase in width.\n(cid:1) You will get the below screen. You will notice that widths of all\ncolumns are now changes to 20\nMS Excel Page 23 of 40\n.\n(cid:1) Click the Undo button to revert to the previous cell width.\nTask 3: Inserting Columns\n(cid:1) Open cash.xls spreadsheet.\n(cid:1) Move to cell B2 and click.\n(cid:1) Click Insert menu, click Columns. You will get the below\nscreen.\nMS Excel Page 24 of 40\n(cid:1) A blank column will be inserted before(to the left of column B)\nTask 4: Deleting Column contents\n(cid:1) Open cash.xls spreadsheet.\n(cid:1) Move the mouse pointer to column E header and click to select\ncolumn E\n(cid:1) Press Delete button. The column contents will be deleted.\n(cid:1) Click Undo button to revert to the previous screen.\nTask 5: Removing columns, rows, and cells completely\n(cid:1) Select individual columns or rows or cells.\n(cid:1) Click Edit menu and click Delete\nTask 6: Inserting a row\n(cid:1) When you insert a row, it is inserted above the current row, so if\nyou want to insert a new row above row 6(between rows 5 and\n6), place the cursor on a cell in row 6 and\n(cid:1) Click on the Insert menu.\n(cid:1) Click Entire Rows insert a blank row between rows 5 and 6.\nTask 7: Deleting row contents\n(cid:1) Open cash.xls spreadsheet.\n(cid:1) Move the mouse pointer to row 2 header and click to select the\nrow as shown below\nMS Excel Page 25 of 40\n(cid:1) Press Delete to remove the contents of row.\n(cid:1) Click the Undo button to cancel the delete operation.\nTask 7: Inserting cells\n(cid:1) Open cash.xls spreadsheet.\n(cid:1) Select cells B2 to D4 by moving the mouse pointer to cell B2,\nholding down the left mouse button and dragging the mouse\npointer to cell D4, then releasing the left button. The cells should\nbe highlighted.\n(cid:1) Click Insert menu and click Cells. This dialog box appears.\n(cid:1) Click OK to shift the cell down.\nMS Excel Page 26 of 40\nTask 8: Changing data justification\n(cid:1) Open cash.xls spreadsheet.\n(cid:1) Select the cell B2 as shown below.\n(cid:1) Here the text “Jan” by default left justified. You can modify\nalignment as right justified or center by clicking right justify\nor center the text\nwithin the cell by clicking respectively.\nTask 9: Merge and Center data\n(cid:1) Open cash.xls spreadsheet.\n(cid:1) Select the cells A1 to H1 as shown below\n(cid:1) Click Merge and Center button on the toolbar\n(cid:1) You will get the below screen.\nMS Excel Page 27 of 40\nTask 10: Formatting cells\n(cid:1) Create a new spreadsheet as shown below and save it as\n“marks.xls”\n(cid:1) Now you can format the cells in column C by selecting column C\nby clicking on the column heading\n(cid:1) Click Format menu and click on Cells. Click on Number.\n(cid:1) Use the Down arrow in the Decimal Places to set to 0. Click\nOK.\n(cid:1) Now repeat the formatting but this time format the cells to two\ndecimal places.\nMS Excel Page 28 of 40\n(cid:1) Again, repeating the formatting operation, but this time to four\ndecimal places.\n(cid:1) Finally, format the cells to eight decimal places. This screen will\nappear.\n(cid:1) The #### symbols indicate that the cell is too narrow to display\nthe data in the chosen format. However, if you increase the cell\nwidth sufficiently, the data will be displayed to eight decimal\nplaces.\n(cid:1) Increase the width column C until the data is displayed.\n(cid:1) Now change the formatting back to two decimal places, and\nreduce the column width to a suitable width.\nChanging the data Orientation (Vertical, Horizontal etc.)\n(cid:1) Excel offers three options that let you control the orientation of\nthe text within a cell. These are Text alignment, Text orientation,\nand Text control.\nVertical text alignment can be any one of the following\nMS Excel Page 29 of 40\nTo display text vertically in a cell:\n¤ Choose Cells from the Format menu.\n¤ Click the Alignment Tab.\n¤ Specify the desired text orientation by selecting one of the\norientation boxes.\n¤ Select the Wrap text check box, if you want Excel to wrap\nthe text\n¤ Click OK\nHere are some examples of the different alignment options\nMS Excel Page 30 of 40\n¤ Select vertical list box and select top to align the data at the\ntop of the cell (Eg: cell A1)\n¤ The below figure shows you different Text control options.\nPrinting and layout\nTask 1: Previewing a printout\n(cid:1) Open cash.xls spreadsheet.\n(cid:1) Click on the File menu and click on Print Preview. A screen\nsimilar to this should appear.\nMS Excel Page 31 of 40\n(cid:1) Since the size of the text is very small, you can click on Zoom\nbutton, it magnifies the worksheet. Clicking on Zoom second\ntime returns you to the original preview format.\n(cid:1) Press PgDn to move through your worksheet if it is more than\none page long.\n(cid:1) Before printing make sure that your printer is switched on, is\nloaded with the appropriate paper, and is on-line.\n(cid:1) If you are happy with the layout of your document, click on the\nPrint button to obtain a printout. You should see a message on\nscreen telling you that your file is being printer, and on which\npaper.\nTask 2: Printing landscape\n(cid:1) To select landscape mode, click on the File menu, Page Setup\nthis screen will appear.\n(cid:1) Click on the Landscape button.\nTask 3: Fitting your worksheet to one page\n(cid:1) In the above screen click on the Fit To: box and type: 1 page\nwide by 1 page tall.\nMS Excel Page 32 of 40\n(cid:1) If you need to make changes to your worksheet before printing,\nclick on the Close button to return to your workbook.\nTask 4: Adjusting margins\n(cid:1) In the Page Setup dialog box, click the Margins tab and enter\nthe appropriate sizes(in inches or centimeters)\nTask 5: Setting Header/Footer to your worksheet\n(cid:1) From the Page Setup dialog box, click on the Header/Footer\ntab to display the below screen.\n(cid:1) In the Header box either you select a title from the drop down\nmenu or enter your own title. Similarly for Footer box also you\ncan set your own title.\n(cid:1) Click on OK.\nTask 6: Printing selected cells\n(cid:1) Open cash.xls spreadsheet.\n(cid:1) Click on the row 2 button (or any other row containing data) to\nhighlight the entire row.\nMS Excel Page 33 of 40\n(cid:1) Click on File, Print Area, Set Print Area. The preview screen\nshould only display the selected cells. (Row 2).\n(cid:1) If the preview is satisfactory, click the Print button to print out\nonly row 2.\n(cid:1) Click on File, Print Area, Clear Print Area to reset the Print\nArea.\nCreating charts and graphs\nTask 1: Creating a Pie Chart\n(cid:1) Open cash.xls spreadsheet.\n(cid:1) Select the cells A1 to G5 as shown below\n(cid:1) Click on Insert menu and click Chart option. This will start the\nOffice Assistant, to guide you through creating chart.\n(cid:1) Follow the instructions in each step of the Wizard. The Assistant\nexplains each step.\n(cid:1) At step 3, you can specify the Chart title, X-axis title and Y-\naxis title separately.\n(cid:1) At step 4, click As object in sheet 1, then click Finish.\n(cid:1) Your chart is now finished. Save as cash4. Your chart is saved\nwith the spreadsheet. This type of chart is known as an\nembedded chart and is saved with its worksheet.\nTask 2: Creating charts when the data range is not continuous\n(cid:1) Open cash4.xls\n(cid:1) If your requirement is create a chart to show expenditure for\nFebruary, then first select cells A2 to A5.\n(cid:1) Hold down the Ctrl key and, while holding it down, select cells\nC2 to C5. Your screen should be similar to this one.\n(cid:1) Click on the Chart Wizard and create a column chart. Your\nscreen should look similar to this.\nMS Excel Page 34 of 40\n(cid:1) If your chart doesn’t appear to show any data, you probably\nincluded some other cells, probably A1 and/or C1. If so, delete\nyour chart and re-select the correct range.\nTask 3: Sizing a chart\n¤ Open the cash3.xls created earlier. A screen similar to this one\nshould appear.\n(cid:1) The small black markers at each corner and mid-way along\neach side of the chart. These indicate that the chart is\nselected, and are called its selection squares.\n(cid:1) Click on the mid-point marker on the right-hand side, hold\ndown the left mouse button and drag the mouse to the right\nabout one inch(3cm), then release the mouse. The width of\nthe chart will have increased.\n(cid:1) Now practice the same operation on the mid-point marker of\neach of the other sides of the chart.\n(cid:1) Now try the above, but this time on one of the four corner\nmarkers. Note that when you use these techniques, the whole\nchart changes in size, but it retains its original proportions.\nMS Excel Page 35 of 40\n(cid:1) Now use the same technique to reduce the size of the chart.\nTask 4: Deleting Charts\n(cid:1) Make sure the chart is selected(the small black markers are\nvisible). If not, move the mouse pointer into the chart area\nand click and release the left mouse button once.\n(cid:1) Press Delete to delete the chart.\nTask 5: Moving charts and graphs\n(cid:1) Make the chart active.\n(cid:1) Move the mouse pointer into the chart area.\n(cid:1) Hold down the left mouse button and drag the chart to the\ndesired position.\nTask 6: Chart headings and labels\n(cid:1) While creating charts the step3 asks for Chart heading,\nlabels for X-axis and Y-axis. You can define your own\nlabels or click Next button so that the default values can be\naccepted.\n(cid:1) For example Chart title is Expenditure, X-axis label is\nmonths and\nY-axis label is Sales\nMS Excel Page 36 of 40\nTask 7: Editing chart items\n(cid:1) Create the chart as shown below and save it as cash4.xls.\n(cid:1) Click the chart title(Expenditure). Selection markers(small black\nsquares) will appear around the selected item.\n(cid:1) You can move or size the title in the same way that you can\nmove or size a chart. Click the title box and drag it up by about\none inch (3 cm), then release the mouse.\n(cid:1) You can format the title by selecting it, then right clicking and\nthen selecting “Format Chart Title” from the drop down menu.\nYou will get the below screen.\nMS Excel Page 37 of 40\n(cid:1) You can select font type, font style and font size as shown\nabove\n(cid:1) Click OK.\nTask 8: Adding text to a chart\n(cid:1) Open cash3.xls worksheet.\n(cid:1) Click View menu, click Toolbars, Drawing.\n(cid:1) Click the Text box icon on the Drawing toolbar.\n(cid:1) Draw a text box inside the chart area as shown below\nMS Excel Page 38 of 40\n(cid:1) Click inside the text box. A flashing text cursor will appear. Now\ntype Household Expenditure\n(cid:1) You can use the same procedure for any other text that you\nwant to appear in charts.\nTask 9: Adding a legend to a chart\n(cid:1) Create a pie chart as shown below.\n(cid:1) Display the Chart toolbar, by dropping down the view menu and\nclicking Toolbars, Chart. In the above figure the legend is\nalready added.\n(cid:1) Click inside the pie chart, then click once on the add or delete\nlegend button on the Chart toolbar. The legend will be added if\nnot already present and removed if it is currently present.\n(cid:1) You can also add or delete a legend from the Chart, Chart\noptions menu\nTask 10: Adding gridlines to a chart\n(cid:1) Open cash3.xls worksheet and change chart type to Column\nchart.\n(cid:1) Click Chart, Chart options to display this box.\n(cid:1) Click the Gridlines tab and tick the gridlines boxes required.\nMS Excel Page 39 of 40\nTask 11: Adding data labels to a chart\n(cid:1) Open cash3 worksheet and change chart type to pie chart.\n(cid:1) Drop-down the chart menu and click Chart options.\n(cid:1) Click on the Data Labels tab.\n(cid:1) Click on Show label and percent. Your screen should look\nsimilar to this.\nMS Excel Page 40 of 40\n\n\nContents\nIntroducing Microsoft PowerPoint 2010 ....................................... ix\nModifying the Display of the Ribbon......................................... xiii\nFeatures and Conventions of This Book....................................... xix\nUsing the Practice Files..................................................... xxi\nGetting Help..............................................................xxv\nBasic Presentations\nPart 1\n1 Explore PowerPoint 2010 3\nWorking in the User Interface...............................................4\nCreating and Saving Presentations..........................................18\nSidebar: Compatibility with Earlier Versions .............................24\nOpening, Moving Around in, and Closing Presentations.......................25\nViewing Presentations in Different Ways.....................................28\nKey Points...............................................................35\n2 Work with Slides 37\nAdding and Deleting Slides................................................37\nAdding Slides with Ready-Made Content....................................40\nSidebar: Working with Slide Libraries...................................45\nSidebar: Exporting Presentations as Outlines............................46\nDividing Presentations into Sections ........................................46\nRearranging Slides and Sections............................................50\nKey Points...............................................................53\nWhat do you think of this book? We want to hear from you!\nMicrosoft is interested in hearing your feedback so we can continually improve our books and learning resources\nfor you. To participate in a brief online survey, please visit:\nmicrosoft.com/learning/booksurvey\niii\niv Contents\n3 Work with Slide Text 55\nEntering Text in Placeholders ..............................................56\nAdding Text Boxes........................................................59\nSidebar: Changing the Default Font for Text Boxes.......................66\nEditing Text..............................................................66\nSidebar: About the Clipboard .........................................71\nCorrecting and Sizing Text While Typing.....................................72\nChecking Spelling and Choosing the Best Words .............................78\nSidebar: Researching Information and Translating Text ...................83\nFinding and Replacing Text and Fonts.......................................84\nKey Points...............................................................87\n4 Format Slides 89\nApplying Themes.........................................................89\nUsing Different Color and Font Schemes ....................................92\nChanging the Slide Background . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .95\nChanging the Look of Placeholders.........................................99\nChanging the Alignment, Spacing, Size, and Look of Text.....................103\nSidebar: Non–Color Scheme Colors...................................110\nKey Points..............................................................111\n5 Add Simple Visual Enhancements 113\nInserting Pictures and Clip Art Images......................................114\nInserting Diagrams ......................................................120\nSidebar: Graphic Formats............................................121\nSidebar: Converting Existing Bullet Points into Diagrams.................128\nInserting Charts.........................................................128\nDrawing Shapes.........................................................136\nSidebar: Connecting Shapes .........................................144\nAdding Transitions.......................................................145\nKey Points..............................................................149\nContents v\n6 Review and Deliver Presentations 151\nSetting Up Presentations for Delivery ......................................152\nPreviewing and Printing Presentations .....................................157\nPreparing Speaker Notes and Handouts....................................161\nSidebar: Enhanced Handouts.........................................167\nFinalizing Presentations ..................................................168\nSidebar: Setting Up Presenter View ...................................174\nDelivering Presentations..................................................175\nKey Points..............................................................178\nPresentation Enhancements\nPart 2\n7 Add Tables 181\nInserting Tables .........................................................181\nFormatting Tables .......................................................185\nInserting and Updating Excel Worksheets ..................................188\nKey Points..............................................................193\n8 Fine-Tune Visual Elements 195\nEditing Pictures .........................................................196\nCustomizing Diagrams ...................................................203\nFormatting Charts.......................................................207\nArranging Graphics......................................................214\nSidebar: Alt Text....................................................220\nKey Points..............................................................221\n9 Add Other Enhancements 223\nAdding WordArt Text . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .223\nInserting Symbols and Equations ..........................................227\nSidebar: Setting Math AutoCorrect Options............................234\nInserting Screen Clippings................................................235\nCreating Hyperlinks......................................................237\nSidebar: Attaching the Same Hyperlink to Every Slide ...................241\nAttaching Actions to Text or Objects.......................................242\nKey Points..............................................................247\nvi Contents\n10 Add Animation 249\nUsing Ready-Made Animations............................................250\nCustomizing Animation Effects............................................254\nKey Points..............................................................261\n11 Add Sound and Movies 263\nInserting and Playing Sounds .............................................263\nInserting and Playing Videos..............................................268\nSidebar: Inserting Videos from Web Sites..............................275\nKey Points..............................................................276\nAdditional Techniques\nPart 3\n12 Share and Review Presentations 279\nCollaborating with Other People ..........................................280\nSidebar: Broadcasting Presentations ..................................282\nSaving Presentations in Other Formats.....................................283\nSending Presentations Directly from PowerPoint ............................289\nSidebar: Adding Digital Signatures....................................292\nPassword-Protecting Presentations ........................................292\nSidebar: Information Rights Management .............................295\nAdding and Reviewing Comments.........................................296\nMerging Presentation Versions............................................299\nKey Points..............................................................303\n13 Create Custom Presentation Elements 305\nCreating Theme Colors and Fonts .........................................306\nViewing and Changing Slide Masters.......................................310\nCreating Slide Layouts ...................................................318\nSaving Custom Design Templates..........................................326\nKey Points..............................................................329\nContents vii\n14 Prepare for Delivery 331\nAdapting Presentations for Different Audiences . . . . . . . . . . . . . . . . . . . . . . . . . . . . .332\nRehearsing Presentations.................................................335\nSidebar: Recording Presentations.....................................338\nPreparing Presentations for Travel . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .340\nSaving Presentations as Videos............................................343\nKey Points..............................................................347\n15 Customize PowerPoint 349\nChanging Default Program Options........................................350\nSidebar: Using Add-ins..............................................358\nCustomizing the Ribbon..................................................359\nCustomizing the Quick Access Toolbar .....................................365\nKey Points..............................................................368\nGlossary................................................................. 369\nKeyboard Shortcuts ....................................................... 375\nIndex.................................................................... 389\nAbout the Authors........................................................ 415\nWhat do you think of this book? We want to hear from you!\nMicrosoft is interested in hearing your feedback so we can continually improve our books and learning resources\nfor you. To participate in a brief online survey, please visit:\nmicrosoft.com/learning/booksurvey\n\nIntroducing Microsoft\nPowerPoint 2010\nMicrosoft PowerPoint 2010 is a full-featured presentation program that helps you quickly\nand efficiently develop dynamic, professional-looking presentations and then deliver\nthem to an audience. You can use PowerPoint to:\n● Introduce an idea, proposal, organization, product, or process with professionally\ndesigned, high-impact slides.\n● Use themes, galleries of styles, and formatting options to achieve the right combi-\nnation of colors, fonts, and effects.\n● Bolster your arguments by easily adding pictures, shapes, and fancy display text.\n● Convey numeric data in easy-to-grasp ways with styled tables or visually compelling\ncharts.\n● Use the SmartArt Graphics tool to create sophisticated diagrams that reflect pro-\ncesses, hierarchies, and other relationships.\n● Create custom themes, designs, and layouts so that your presentations have a\nunique look and feel.\n● Collaborate with colleagues, giving and receiving feedback to ensure the best\npossible presentation.\nPowerPoint 2010 builds on previous versions to provide powerful tools for all your pre-\nsentation needs. This introduction provides an overview of new features that we explore\nthroughout the book.\nNew Features\nIf you’re upgrading to PowerPoint 2010 from a previous version, you’re probably most\ninterested in the differences between the old and new versions and how they will affect\nyou, as well as how to find out about them in the quickest possible way. The following\nsections list new features you will want to be aware of, depending on the version\nof PowerPoint you are upgrading from.\nix\nx Introducing Microsoft PowerPoint 2010\nIf You Are Upgrading from PowerPoint 2007\nIf you have been using PowerPoint 2007, you might be wondering how Microsoft could\nhave improved on what seemed like a pretty comprehensive set of features and tools.\nThe list of new features includes the following:\n● The Backstage view Finally, all the tools you need to work with your files, as\nopposed to their content, really are accessible from one location. You display the\nBackstage view by clicking the File tab, which replaces the Microsoft Office Button\nat the left end of the ribbon.\n● Customizable ribbon The logical next step in the evolution of the command cen-\nter introduced with PowerPoint 2007: Create your own tabs and groups to suit the\nway you work.\n● A window for each presentation You no longer display all presentations in the\nsame window, so you can arrange open presentations for easy comparison or\nwork on different presentations at the same time.\n● Reading view This new way to preview presentations makes it easy to quickly\ncheck the effect of one or two changes.\n● Presentation videos Now turning a presentation into a Windows Media Video is\na simple matter of saving in that format.\n● Paste preview No more trial and error when moving items to new locations.\nPreview what an item will look like in each of the available formats, and then pick\nthe one you want.\n● Animation Painter If you spend time developing a complex animation for one\nobject, you can now copy the animation settings to another object with a few\nmouse clicks.\n● New themes and transitions Adding pizzazz to your presentations is just a matter\nof applying a professional-looking theme or a snazzy dynamic-content transition.\n● Graphics editing Found the perfect picture, but its colors or style aren't quite right\nfor your presentation? Now after inserting a picture, you can edit it in new ways.\nIn addition to changing color, brightness, and contrast, you can remove the back-\nground and, most exciting of all, apply artistic effects that make it appear like a\nwatercolor, pencil drawing, or pastel sketch.\nIntroducing Microsoft PowerPoint 2010 xi\n● Improved cropping Not only can you drag crop handles to manually crop a\npicture but you can also apply a built-in cropping ratio and then move the crop-\nping \"window\" around over the picture until you get precisely the part you want.\n● Text effects WordArt has had a makeover. You can still use WordArt to create\ndistinctive headlines, but now you can use its effects on any selected text.\n● Screenshots You no longer need to go outside of PowerPoint when you want to\ninsert a screenshot into a slide. This capability is now built into Word.\n● Improved SmartArt Graphics tool A whole new category has been added to\nSmartArt so that you can include pictures as well as text in your diagrams.\n● Video tools Found a perfect video, but it is too long to include in a presenta-\ntion? Now you can insert the video and then use the video editing tools built into\nPowerPoint to trim and format it. You can also insert a link to a video on a Web\nsite into a slide.\n● Version merging You can merge two versions of the same presentation and\naccept or reject changes.\n● Team collaboration Team members can now work simultaneously on a presenta-\ntion stored on a Microsoft SharePoint 2010 server or in Windows Live SkyDrive.\n● Broadcasting You can review a presentation with colleagues via the Web by work-\ning through a free broadcasting service. Your colleagues can view the presentation\nin their Web browsers and give feedback via a conference call.\n● Language support If you need to conduct business internationally across language\nlines, you can easily tailor the language of your working environment. You can also\nuse new translation tools to collaborate with team members in other countries.\n● Unsaved file recovery How many times have you responded No without thinking\nto the \"save changes\" message when closing files, only to find that you have dis-\ncarded work you wanted to keep? PowerPoint now preserves your unsaved files\nfor a period of time, allowing you to recover them if you need them.\nxii Introducing Microsoft PowerPoint 2010\nIf You Are Upgrading from PowerPoint 2003\nIn addition to the features listed in the previous section, if you’re upgrading from\nPowerPoint 2003, you’ll want to take note of the new features that were introduced in\nPowerPoint 2007. The 2007 upgrade provided a more efficient working environment\nand included a long list of new and improved features, including the following:\n● The Microsoft Office Fluent Ribbon No more hunting through menus, submenus,\nand dialog boxes. This new interface organizes all the commands most people use\nmost often, making them quickly accessible from tabs at the top of the program\nwindow.\n● Live Preview See the effect of a style, theme, or other option before you apply it.\n● Custom layouts Easily create your own layouts with placeholders for specific\nobjects, and then save them for use in other presentations.\n● SmartArt Graphics tool Use this awesome new diagramming tool to create sophis-\nticated diagrams with 3-D shapes, transparency, drop shadows, and other effects.\n● Improved charting Enter data in a linked Microsoft Excel worksheet and watch as\nyour data is instantly plotted in the chart type of your choosing.\n● Slide libraries Share slide content with team members in a special SharePoint\nlibrary for presentations and slides.\n● Presentation cleanup Have PowerPoint check for and remove comments, hidden\ntext, and personal information stored as properties before you declare a presenta-\ntion final.\n● New file format The new Microsoft Office Open XML Formats reduce file size and\nhelp avoid loss of data.\nLet’s Get Started!\nWe’ve been working with PowerPoint since its debut, and each version has offered\nsomething that made daily presentation creation a little easier. Microsoft PowerPoint\n2010 is no exception, and we look forward to showing you around.\nModifying the Display of the Ribbon\nThe goal of the Microsoft Office 2010 working environment is to make working with\nOffice files—including Microsoft Word documents, Excel workbooks, PowerPoint pre-\nsentations, Outlook e-mail messages, and Access databases—as intuitive as possible. You\nwork with an Office file and its contents by giving commands to the program in which\nthe document is open. All Office 2010 programs organize commands on a horizontal bar\ncalled the ribbon, which appears across the top of each program window whether or not\nthere is an active document.\nRibbon tabs Ribbon groups\nA typical program window ribbon.\nCommands are organized on task-specific tabs of the ribbon, and in feature-specific\ngroups on each tab. Commands generally take the form of buttons and lists. Some\nappear in galleries. Some groups have related dialog boxes or task panes that contain\nadditional commands.\nThroughout this book, we discuss the commands and ribbon elements associated with\nthe program feature being discussed. In this topic, we discuss the general appearance\nof the ribbon, things that affect its appearance, and ways of locating commands that\naren’t visible on compact views of the ribbon.\nSee Also For detailed information about the ribbon in Microsoft PowerPoint, see\n“Working in the User Interface” in Chapter 1, “Explore PowerPoint 2010.”\nTip Some older commands no longer appear on the ribbon, but are still available in the\nprogram. You can make these commands available by adding them to the Quick Access\nToolbar. For more information, see “Customizing the Quick Access Toolbar” in Chapter 15,\n“Customize PowerPoint.”\nxiii\nxiv Modifying the Display of the Ribbon\nDynamic Ribbon Elements\nThe ribbon is dynamic, meaning that the appearance of commands on the ribbon\nchanges as the width of the ribbon changes. A command might be displayed on the\nribbon in the form of a large button, a small button, a small labeled button, or a list\nentry. As the width of the ribbon decreases, the size, shape, and presence of buttons\non the ribbon adapt to the available space.\nFor example, when sufficient horizontal space is available, the buttons on the Review\ntab of the Word program window are spread out and you’re able to see more of the\ncommands available in each group.\nSmall labeled button\nDrop-down list Large button\nThe Review tab of the Word program window at 1024 pixels wide.\nIf you decrease the width of the ribbon, small button labels disappear and entire groups\nof buttons hide under one button that represents the group. Click the group button to\ndisplay a list of the commands available in that group.\nGroup button Small unlabeled buttons\nThe Review tab of the Word program window at 675 pixels wide.\nWhen the window becomes too narrow to display all the groups, a scroll arrow appears\nat its right end. Click the scroll arrow to display hidden groups.\nModifying the Display of the Ribbon xv\nScroll arrow\nThe Review tab of the Word program window at 340 pixels wide.\nChanging the Width of the Ribbon\nThe width of the ribbon is dependent on the horizontal space available to it, which\ndepends on these three factors:\n● The width of the program window Maximizing the program window provides\nthe most space for ribbon elements. You can resize the program window by\nclicking the button in its upper-right corner or by dragging the border of a\nnon-maximized window.\nTip On a computer running Windows 7, you can maximize the program window by\ndragging its title bar to the top of the screen.\n● Your screen resolution Screen resolution is the size of your screen display expressed\nas pixels wide × pixels high. The greater the screen resolution, the greater the\namount of information that will fit on one screen. Your screen resolution options\nare dependent on your monitor. At the time of writing, possible screen resolutions\nrange from 800 × 600 to 2048 × 1152. In the case of the ribbon, the greater the\nnumber of pixels wide (the first number), the greater the number of buttons that\ncan be shown on the ribbon, and the larger those buttons can be.\nOn a computer running Windows 7, you can change your screen resolution from\nthe Screen Resolution window of Control Panel.\nxvi Modifying the Display of the Ribbon\nYou set the resolution by dragging the pointer on the slider.\n● The density of your screen display You might not be aware that you can change\nthe mag nification of everything that appears on your screen by changing the screen\nmagnification setting in Windows. Setting your screen magnification to 125% makes\ntext and user interface elements larger on screen. This increases the legibility of\ninformation, but means that less fits onto each screen.\nOn a computer running Windows 7, you can change the screen magnification from\nthe Display window of Control Panel.\nModifying the Display of the Ribbon xvii\nYou can choose one of the standard display magnification options, or create another by\nsetting a custom text size.\nThe screen magnification is directly related to the density of the text elements on\nscreen, which is expressed in dots per inch (dpi) or points per inch (ppi). (The terms\nare interchangeable, and in fact are both used in the Windows dialog box in which\nyou change the setting.) The greater the dpi, the larger the text and user interface\nelements appear on screen. By default, Windows displays text and screen elements\nat 96 dpi. Choosing the Medium - 125% display setting changes the dpi of text\nand screen elements to 120 dpi. You can choose a custom setting of up to 500%\nmagnification, or 480 dpi, in the Custom DPI Setting dialog box.\nYou can choose a magnification of up to 200% from the lists, or choose\na greater magnification by dragging across the ruler from left to right.\nxviii Modifying the Display of the Ribbon\nSee Also For more information about display settings, refer to Windows 7 Step by Step\n(Microsoft Press, 2009), Windows Vista Step by Step (Microsoft Press, 2006), or Windows XP\nStep by Step (Microsoft Press, 2002) by Joan Lambert Preppernau and Joyce Cox.\nAdapting Exercise Steps\nThe screen images shown in the exercises in this book were captured at a screen resolu-\ntion of 1024 x 768, at 100% magnification, and the default text size (96 dpi). If any of\nyour settings are different, the ribbon on your screen might not look the same as the one\nshown in the book. For example, you might see more or fewer buttons in each of the\ngroups, the buttons you see might be represented by larger or smaller icons than those\nshown, or the group might be represented by a button that you click to display the\ngroup’s commands.\nWhen we instruct you to give a command from the ribbon in an exercise, we do it in this\nformat:\n● On the Insert tab, in the Illustrations group, click the Chart button.\nIf the command is in a list, we give the instruction in this format:\n● On the Page Layout tab, in the Page Setup group, click the Breaks button and\nthen, in the list, click Page.\nThe first time we instruct you to click a specific button in each exercise, we display an\nimage of the button in the page margin to the left of the exercise step.\nIf differences between your display settings and ours cause a button on your screen to\nlook different from the one shown in the book, you can easily adapt the steps to locate\nthe command. First, click the specified tab. Then locate the specified group. If a group\nhas been collapsed into a group list or group button, click the list or button to display\nthe group’s commands. Finally, look for a button that features the same icon in a larger\nor smaller size than that shown in the book. If necessary, point to buttons in the group\nto display their names in ScreenTips.\nIf you prefer not to have to adapt the steps, set up your screen to match ours while you\nread and work through the exercises in the book.\nFeatures and Conventions\nof This Book\nThis book has been designed to lead you step by step through all the tasks you’re most\nlikely to want to perform in Microsoft PowerPoint 2010. If you start at the beginning\nand work your way through all the exercises, you will gain enough proficiency to be\nable to create and work with most types of PowerPoint presentations. However, each\ntopic is self contained. If you have worked with a previous version of PowerPoint, or if\nyou completed all the exercises and later need help remembering how to perform a\nprocedure, the following features of this book will help you locate specific information:\n● Detailed table of contents Search the listing of the topics and sidebars within\neach chapter.\n● Chapter thumb tabs Easily locate the beginning of the chapter you want.\n● Topic-specific running heads Within a chapter, quickly locate the topic you\nwant by looking at the running heads at the top of odd-numbered pages.\n● Glossary Look up the meaning of a word or the definition of a concept.\n● Keyboard Shortcuts If you prefer to work from the keyboard rather than with\na mouse, find all the shortcuts in one place.\n● Detailed index Look up specific tasks and features in the index, which has been\ncarefully crafted with the reader in mind.\nYou can save time when reading this book by understanding how the Step by Step series\nshows exercise instructions, keys to press, buttons to click, and other information.\nxix\nxx Features and Conventions of This Book\nConvention Meaning\nSET UP This paragraph preceding a step-by-step exercise indicates the prac-\ntice files that you will use when working through the exercise. It also\nindicates any requirements you should attend to or actions you should\ntake before beginning the exercise.\nCLEAN UP This paragraph following a step-by-step exercise provides instructions\nfor saving and closing open files or programs before moving on to an-\nother topic. It also suggests ways to reverse any changes you made to\nyour computer while working through the exercise.\n1 Blue numbered steps guide you through hands-on exercises in each\ntopic.\n2\n1 Black numbered steps guide you through procedures in sidebars and\nexpository text.\n2\nSee Also This paragraph directs you to more information about a topic in this\nbook or elsewhere.\nTroubleshooting This paragraph alerts you to a common problem and provides guid-\nance for fixing it.\nTip This paragraph provides a helpful hint or shortcut that makes working\nthrough a task easier.\nImportant This paragraph points out information that you need to know to com-\nplete a procedure.\nKeyboard Shortcut This paragraph provides information about an available keyboard\nshortcut for the preceding task.\nCtrl+B A plus sign (+) between two keys means that you must press those\nkeys at the same time. For example, “Press Ctrl+B” means that you\nshould hold down the Ctrl key while you press the B key.\nPictures of buttons appear in the margin the first time the button is\nused in a chapter.\nBlack bold In exercises that begin with SET UP information, the names of program\nelements, such as buttons, commands, windows, and dialog boxes,\nas well as files, folders, or text that you interact with in the steps, are\nshown in black, bold type.\nBlue bold In exercises that begin with SET UP information, text that you should\ntype is shown in blue bold type.\nUsing the Practice Files\nBefore you can complete the exercises in this book, you need to copy the book’s practice\nfiles to your computer. These practice files, and other information, can be downloaded\nfrom the book’s detail page, located at:\nhttp://go.microsoft.com/fwlink/?Linkid=192149\nDisplay the detail page in your Web browser and follow the instructions for downloading\nthe files.\nImportant The Microsoft PowerPoint 2010 program is not available from this Web site. You\nshould purchase and install that program before using this book.\nThe following table lists the practice files for this book.\nChapter File\nChapter 1: BuyingTrip_start.pptx\nExplore PowerPoint 2010 DesigningColor_start.pptx\nMayMeeting_start.pptx\nSalesMeetingMay_start.pptx\nChapter 2: Projects.pptx\nWork with Slides ServiceA_start.pptx\nServiceB_start.pptx\nServiceC_start.pptx\nServiceD_start.pptx\nServiceOrientation.docx\nChapter 3: BuyingTripsB_start.pptx\nWork with Slide Text BuyingTripsC_start.pptx\nCommunityServiceA_start.pptx\nCommunityServiceB_start.pptx\nCommunityServiceC_start.pptx\nChapter 4: BusinessTravelA_start.pptx\nFormat Slides BusinessTravelB_start.pptx\nColorDesign_start.pptx\nCompanyMeetingA_start.pptx\nCompanyMeetingB_start.pptx\nLandscaping_start.pptx\nxxi\na07u626911.indd 21 4/11/11 4:58 PM\nxxii Using the Practice Files\nChapter File\nChapter 5: Agastache.jpg\nAdd Simple Visual JournalingA_start.pptx\nEnhancements\nJournalingB_start.pptx\nPenstemon.jpg\nWaterConsumption.xlsx\nWaterSavingA_start.pptx\nWaterSavingB_start.pptx\nWaterSavingC_start.pptx\nChapter 6: Harmony_start.pptx\nReview and Deliver Meeting_start.pptx\nPresentations\nSavingWater_start.pptx\nServiceOrientationA_start.pptx\nServiceOrientationB_start.pptx\nYinYang.png\nChapter 7: FinancialMeeting_start.pptx\nAdd Tables NewEquipment.xlsx\nTemperature_start.pptx\nTemperatureFormatted_start.pptx\nChapter 8: GardenResidents_start.pptx\nFine-Tune Visual Elements LandscapingChart_start.pptx\nNativePlant1.jpg through NativePlant8.jpg\nPhotoAlbumTitleSlide.pptx\nReorganizationMeeting_start.pptx\nChapter 9: DesertPlants_start.pptx\nAdd Other Enhancements MeetingAction_start.pptx\nOrganization_start.pptx\nOrganizationLinks_start.pptx\nProcedures.docx\nTemperatureCelsius_start.pptx\nChapter 10: NaturalGardeningA_start.pptx\nAdd Animation NaturalGardeningB_start.pptx\nUsing the Practice Files xxiii\nChapter File\nChapter 11: AGKCottage_start.pptx\nAdd Sound and Movies Amanda.wma\nBird.jpg\nButterfly.wmv\nHealthyEcosystemsA_start.pptx\nHealthyEcosystemsB_start.pptx\nWildlife.wmv\nChapter 12: CottageShow_start.pptx\nShare and Review HarmonyReview_start.pptx\nPresentations\nMeetingCompareA_start.pptx\nMeetingCompareB_start.pptx\nMeetingThemeA_start.pptx\nMeetingThemeB.pptx\nMeetingThemeC.pptx\nServiceProjects_start.pptx\nWaterUse_start.pptx\nChapter 13: NativePlant1.jpg through NativePlant3.jpg\nCreate Custom Presentation NaturalLayout_start.pptx\nElements\nNaturalMaster_start.pptx\nNaturalTemplate_start.pptx\nChapter 14: CottageVideo_start.pptx\nPrepare for Delivery JournalingTimings_start.pptx\nOrganizationCD_start.pptx\nProcedures.docx\nServiceShows_start.pptx\nChapter 15: BuyersSeminar_start.pptx\nCustomize PowerPoint ColorNew_start.pptx\nxxiv Using the Practice Files\nYour Companion eBook\nThe eBook edition of this book allows you to:\n● Search the full text\n● Print\n● Copy and paste\nTo download your eBook, please see the instruction page at the back of this book.\nGetting Help\nEvery effort has been made to ensure the accuracy of this book. If you do run into\nproblems, please contact the sources listed in the following sections.\nGetting Help with This Book\nIf your question or issue concerns the content of this book or its practice files, please\nfirst consult the book’s errata page, which can be accessed at:\nhttp://go.microsoft.com/fwlink/?Linkid=192149\nThis page provides information about known errors and corrections to the book. If\nyou do not find your answer on the errata page, send your question or comment to\nMicrosoft Press Technical Support at:\nmspinput@microsoft.com\nGetting Help with PowerPoint 2010\nIf your question is about Microsoft PowerPoint 2010, and not about the content of this\nbook, your first recourse is the PowerPoint Help system. This system is a combination of\ntools and files stored on your computer when you installed PowerPoint and, if your com-\nputer is connected to the Internet, information available from Office.com. You can find\ngeneral or specific Help information in the following ways:\n● To find out about an item on the screen, you can display a ScreenTip. For example, to\ndisplay a ScreenTip for a button, point to the button without clicking it. The ScreenTip\ngives the button’s name, the associated keyboard shortcut if there is one, and unless\nyou specify otherwise, a description of what the button does when you click it.\n● In the PowerPoint program window, you can click the Microsoft PowerPoint Help\nbutton (a question mark in a blue circle) at the right end of the ribbon to display\nthe PowerPoint Help window.\n● After opening a dialog box, you can click the Help button (also a question mark)\nat the right end of the dialog box title bar to display the PowerPoint Help window.\nSometimes, topics related to the functions of that dialog box are already identified\nin the window.\nxxv\na08g626911.indd 25 4/11/11 4:59 PM\nxxvi Getting Help\nTo practice getting help, you can work through the following exercise.\nSET UP You don’t need any practice files to complete this exercise. Start PowerPoint,\nand then follow the steps.\n1. At the right end of the ribbon, click the Microsoft PowerPoint Help button.\nThe PowerPoint Help window opens.\nYour Help window might look different from this one because the\nmaterial on the Office.com Web site is constantly being updated.\nTip You can maximize the window or adjust its size by dragging the handle in the lower-\nright corner. You can change the size of the font by clicking the Change Font Size button\non the toolbar.\nGetting Help xxvii\n2. Below the bulleted list under Browse PowerPoint 2010 support, click see all.\nThe window changes to display a list of help topics.\n3. In the list of topics, click Activating PowerPoint.\nPowerPoint Help displays a list of topics related to activating Microsoft Office\nprograms. You can click any topic to display the corresponding information.\n4. On the toolbar, click the Show Table of Contents button, and then scroll down\nthe pane that appears on the left.\nLike the table of contents in a book, the Help table of contents is organized in sec-\ntions. If you’re connected to the Internet, PowerPoint displays sections, topics, and\ntraining available from the Office Online Web site as well as those stored on your\ncomputer.\nClicking any section (represented by a book icon) displays that section’s topics (represented by\nhelp icons).\nxxviii Getting Help\n5. In the Table of Contents pane, click a few sections and topics. Then click the Back\nand Forward buttons to move among the topics you have already viewed.\n6. At the right end of the Table of Contents title bar, click the Close button.\n7. At the top of the PowerPoint Help window, click the Search box, type saving, and\nthen press the Enter key.\nThe PowerPoint Help window displays topics related to the word you typed.\nNext and Back buttons appear to make it easier to search for the topic you want.\nTip If you enter a term in the Search box and then click the adjacent Search arrow,\nyou specify the type of help you are looking for or where you want to look for it.\nGetting Help xxix\n8. In the results list, click the Recover earlier versions of a file in Office 2010 topic.\nThe selected topic appears in the PowerPoint Help window.\n9. Below the title at the top of the topic, click Show All.\nPowerPoint displays any hidden auxiliary information available in the topic and\nchanges the Show All button to Hide All. You can jump to related information by\nclicking hyperlinks identified by blue text.\nTip You can click the Print button on the toolbar to print a topic. Only the displayed\ninformation is printed.\nCLEAN UP Click the Close button in the upper-right corner of the PowerPoint Help\nwindow.\nMore Information\nIf your question is about Microsoft PowerPoint 2010 or another Microsoft software\nproduct and you cannot find the answer in the product’s Help system, please search\nthe appropriate product solution center or the Microsoft Knowledge Base at:\nsupport.microsoft.com\nIn the United States, Microsoft software product support issues not covered by the\nMicrosoft Knowledge Base are addressed by Microsoft Product Support Services.\nLocation-specific software support options are available from:\nsupport.microsoft.com/gp/selfoverview/\n\nChapter at a Glance\nEdit pictures,\npage 196\nCustomize diagrams,\npage 203\nFormat charts,\npage 207\nArrange graphics,\npage 214\n8\nFine-Tune Visual\nElements\nIn this chapter, you will learn how to\n✔ Edit pictures.\n✔ Customize diagrams.\n✔ Format charts.\n✔ Arrange graphics.\nIn Chapter 5, “Add Simple Visual Enhancements,” you were introduced to the primary\nways you can use graphic elements to convey information or dress up your slides. You\ninserted pictures and clip art images, created a diagram, plotted data in a chart, drew\nshapes, and eased the transition from one slide to another with a graphic effect. These\nsimple techniques might be all you need to enhance your presentations. But if you\nneed to manipulate graphic elements to produce more dramatic effects, you can push\nthe Microsoft Office PowerPoint 2010 capabilities further to get just the result you are\nlooking for.\nIn this chapter, you’ll create a photo album and insert and manipulate photographs.\nNext, you’ll manipulate shapes to customize an organization chart. Then you’ll format a\nchart and save it as a template. Finally, you’ll use various techniques to arrange graphics.\nPractice Files Before you can complete the exercises in this chapter, you need to copy\nthe book’s practice files to your computer. The practice files you’ll use to complete the\nexercises in this chapter are in the Chapter08 practice file folder. A complete list of\npractice files is provided in “Using the Practice Files” at the beginning of this book.\n195\n196 Chapter 8 Fine-Tune Visual Elements\nEditing Pictures\nFrom time to time in this book, we have alluded to the modern trend away from slides\nwith bullet points and toward presentations that include more graphics. Successful\npresenters have learned that most people can’t listen to a presentation while they are\nreading slides. So these presenters make sure most of their slides display graphics that\nrepresent the point they are making, giving the audience something to look at while\nthey focus on what is being said.\nPowerPoint 2010 gives you the tools you need to create graphic-intensive rather than\ntext-intensive presentations. When you want to display a dynamic array of pictures in\na presentation, you can use a photo album template to do the initial layout and then\ncustomize the album by adding frames of different shapes, as well as captions.\nTip To integrate the slide layouts from a photo album template into a more traditional\npresentation, create the photo album and then import its slides into the other presentation\nby clicking Reuse Slides at the bottom of the New Slide gallery. For information about reusing\nslides, see “Adding Slides with Ready-Made Content” in Chapter 2, “Work with Slides.”\nAfter you insert any picture into a presentation, you can modify it by using the buttons\non the Format tab that is displayed on the ribbon only when the graphic is selected. For\nexample, you can do the following:\n● Remove the background by clicking the Remove Background button and then\ndesignating either the areas you want to keep or those you want to remove.\n● Sharpen or soften the picture, or change its brightness or contrast, by choosing\nthe effect you want from the Corrections gallery.\n● Enhance the picture’s color by making a selection from the Color gallery.\n● Make one of the picture’s colors transparent by clicking Set Transparent Color at\nthe bottom of the gallery and then selecting the color.\n● Choose an effect, such as Pencil Sketch or Paint Strokes, from the Artistic Effects\ngallery.\n● Apply effects such as shadows, reflections, and borders, or apply combinations\nof these effects by choosing a predefined style from the Picture Styles gallery.\n● Add a border consisting of one or more solid or dashed lines of whatever width\nand color you choose.\n● Rotate the picture to any angle, either by dragging the green rotating handle or\nby clicking the Rotate button and then choosing a rotating or flipping option.\n● Crop away the parts of the picture that you don’t want to show on the slide.\n(The picture itself is not altered—parts of it are simply covered up.)\nEditing Pictures 197\n● Minimize the presentation’s file size by clicking the Compress Pictures button and\nthen choosing where or how the presentation will be viewed—for example, on\nthe Web or printed—to determine the optimum resolution. You can also delete\ncropped areas of a picture to reduce file size.\nIn this exercise, you’ll create a photo album displaying pictures of native plants. You’ll\ncrop, resize, remove the background, apply an artistic effect, and add captions.\nYou’ll also reuse a slide from another photo album, and apply a theme.\nSET UP You need the NativePlant1 through NativePlant8 photographs and the\nPhotoAlbumTitleSlide presentation located in your Chapter08 practice file folder to\ncomplete this exercise. Open a blank presentation, and then follow the steps.\n1. On the Insert tab, in the Images group, click the Photo Album button.\nThe Photo Album dialog box opens.\n2. Under Insert picture from, click File/Disk.\nThe Insert New Pictures dialog box opens.\n3. Navigate to your Chapter08 practice file folder, click NativePlant1, hold down\nthe Ctrl key, and click NativePlant3 through NativePlant5. Then click Insert.\nThe Photo Album dialog box now has four graphics files listed in the Pictures In\nAlbum list.\nYou can click each picture in turn to view it in the Preview box.\n198 Chapter 8 Fine-Tune Visual Elements\n4. In the Pictures in album list, click NativePlant4, and then click the Move Up\nbutton to make it the second picture in the list.\n5. Preview the pictures in turn, and then click the Contrast and Brightness buttons\nas necessary to give the four photographs a more even tone.\nYou could also adjust the rotation of a picture, but in this case, that is not necessary.\n6. In the Album Layout area, display the Picture layout list, and click 2 pictures.\n7. Display the Frame shape list, click Rounded Rectangle. Then click Create.\nPowerPoint creates a presentation called Photo Album that contains a title slide\nand two slides each containing two pictures.\nOn the title slide, PowerPoint inserts the user name stored in the PowerPoint Options\ndialog box.\nTroubleshooting The appearance of buttons and groups on the ribbon changes\ndepending on the width of the program window. For information about changing the\nappearance of the ribbon to match our screen images, see “Modifying the Display of\nthe Ribbon” at the beginning of this book.\n8. Save the presentation as My Photo Album.\n9. Display Slide 2, and click the photo on the left. Then on the Format contextual tab,\nin the Size group, click the Crop arrow. In the list, point to Aspect Ratio, and then\nunder Portrait, click 2:3.\nEditing Pictures 199\nPowerPoint crops away parts of the picture, leaving a centered “window” over the\nphoto, sized to the proportions you specified.\nCropping handles surround the active area so that if you want, you\ncan adjust the cropped areas.\n10. Click the photo on the right, and then repeat the cropping process in step 9.\n11. In turn, select each photo, and drag the upper-left and bottom-right corner\nhandles until the photos occupy the majority of the space on the slide.\nTip When sizing the photo on the right, release the mouse button when the dotted\nguide appears, letting you know that the photo is aligned with the photo on the left.\n12. Display slide 3, and crop the photo on the left to Square, 1:1. Then point inside\nthe crop window, and drag to the left until the cropping window is centered on\nthe flower.\nPowerPoint maintains the size of the crop window but moves the photo under\nthe window to the left.\nThe image of the flower is centered in the crop window.\n200 Chapter 8 Fine-Tune Visual Elements\n13. Click the photo on the right, and in the Size group, use the down arrow to reduce\nthe height to 3”. Then crop the photo to Square, 1:1, adjusting the crop window\nso that all of the flower is showing.\n14. Enlarge and align the photos so that they occupy the entire width of the slide.\n15. Click the left photo, and in the Adjust group, click the Remove Background\nbutton.\nThe Background Removal contextual tab appears, and PowerPoint marks the\nareas of the photo that will be removed.\nThe thumbnail on the Slides tab shows what the flower will look like after its background\nis removed.\n16. Drag the handles on the frame surrounding the flower until the entire flower is\nvisible within the frame. Then in the Close group, click the Keep Changes button.\n17. Repeat steps 15 and 16 to remove the background of the photo on the right. Then\nclick a blank area of the slide.\nThe background is removed from both flower photos.\nEditing Pictures 201\nThe flowers stand out vividly against the plain slide background.\n18. Click the photo on the left, and then on the Format tab, in the Adjust group, click\nthe Artistic Effects button.\nThe Artistic Effects gallery appears.\nYou can choose from a wide variety of effects in this gallery.\n202 Chapter 8 Fine-Tune Visual Elements\n19. Point to each thumbnail in turn to see a live preview of the photo with the\neffect applied. Then click the third thumbnail in the second row (Paint Brush).\n20. Repeat steps 18 and 19 for the photo on the right.\nThe two photos now resemble paintings.\n21. On the Insert tab, in the Images group, click the Photo Album arrow, and then\nclick Edit Photo Album.\nThe Edit Photo Album dialog box opens. This dialog box is the same as the Photo\nAlbum dialog box. With it, you can make changes to an existing photo album.\n22. In the dialog box, under Picture Options, select the Captions below ALL pictures\ncheck box, and then click Update.\n23. Replace the file names below each photograph with the following captions:\nNativePlant1 Achillea\nNativePlant4 Hedysarum\nNativePlant3 Gaillardia\nNativePlant5 Oenothera\n24. Click slide 1, and on the Home tab, in the Slides group, click the New Slide arrow,\nand at the bottom of the gallery, click Reuse Slides.\nThe Reuse Slides task pane opens.\n25. In the Reuse Slides task pane, click Browse, and click Browse File. Then browse to\nyour Chapter08 practice file folder, and double-click the PhotoAlbumTitleSlide\npresentation.\nThis presentation contains one slide that was based on a slide in the Contemporary\nPhoto Album template available under the Sample Templates on the New page of\nthe Backstage view.\n26. In the Reuse Slides task pane, click Slide 1 to insert it after the title slide of the\nMy Photo Album presentation. Then close the task pane.\n27. Delete the blank title slide. Then on the Design tab, in the Themes group, display\nthe Themes gallery, and select a theme that showcases the photos.\nWe chose the Trek theme.\nCustomizing Diagrams 203\nCareful theme selection can pull an entire presentation together.\nCLEAN UP Save the My Photo Album presentation, and then close it.\nCustomizing Diagrams\nWe’ve already told you how to use SmartArt to create a diagram, and we’ve shown\nyou how to move and size it and apply simple formatting. But many diagrams involve\ndifferent levels of information and benefit from more sophisticated formatting tech-\nniques. After you create a basic diagram, you can customize it at any time by clicking\nit and then using the commands on the Design and Format contextual tabs.\nYou can use the commands on the Design contextual tab to make changes such as\nthe following:\n● Add and change the hierarchy of shapes.\nTip You can remove a shape by selecting it and then pressing the Delete key.\nYou can also rearrange shapes by dragging them.\n204 Chapter 8 Fine-Tune Visual Elements\n● Switch to a different layout of the same type or a different type.\nTip If some of the text in the original diagram doesn’t fit in the new layout, that text is not\nshown, but it is retained so that you don’t have to retype it if you change the layout again.\nYou can use the buttons on the Format contextual tab to customize individual shapes\nin the following ways:\n● Change an individual shape—for example, change a square to a star to make it\nstand out.\n● Apply a built-in Shape Style.\n● Change the color, outline, or effect of a selected shape.\nTip If you customize a diagram and then decide you preferred the original version, you can\nrevert to the original by clicking the Reset Graphic button in the Reset group on the Design\ncontextual tab.\nIn this exercise, you’ll customize an organization chart by adding subordinate shapes.\nYou’ll change the layout of the chart as a whole and then change the color, size, and\ntext of individual shapes.\nSET UP You need the ReorganizationMeeting_start presentation located in your\nChapter08 practice file folder to complete this exercise. Open the Reorganization-\nMeeting_start presentation, and save it as ReorganizationMeeting. Then follow\nthe steps.\n1. Display slide 5, click the diagram to activate it, and then select the Ryan Danner\nshape for manipulation.\n2. On the Design contextual tab, in the Create Graphic group, click the Add Shape\narrow, and then click Add Shape Below.\nPowerPoint adds a shape to the organization chart.\n3. Open the Text pane, click to the right of the bullet symbol, type Jerry Orman,\nand press Enter.\nPowerPoint adds a duplicate shape at the same level in the hierarchy.\nThe colors of the shapes in the diagram reflect the theme color scheme\nCustomizing Diagrams 205\nTroubleshooting Our instructions assume you are entering text in the Text pane. Typing\nand pressing Enter in a diagram shape enters a new paragraph in the same shape instead\nof creating a new shape.\n4. Type Nate Sun.\n5. In the Text pane, click to the right of Erin Hagens, press Enter, press Tab, and then\ntype Sarah Davis.\nThe new shape is a subordinate of Erin Hagens.\n6. In the diagram, select the Florian Stiller shape for manipulation, click the Add\nShape arrow in the Create Graphic group, and then click Add Assistant.\n7. In the Text pane, click to the right of the arrow bullet symbol, and type Andy\nRuth. Then close the Text pane.\n8. In the diagram, select the Nate Sun shape for manipulation, and then in the\nCreate Graphic group, click the Promote button.\nThe selected shape moves up one level in the hierarchy.\nNate Sun is now a peer of his former manager.\nTroubleshooting Don’t worry if your chart still shows the box and handles in the former\nlocation of the Nate Sun shape. It will disappear when you work on a different shape.\n9. Drag the handles around the frame of the diagram until it fills the available space\non the slide.\n10. On the Design contextual tab, display the Layouts gallery, and point to each\nthumbnail in turn to see a live preview of the various layout options for an organi-\nzation chart. Then click the second thumbnail in the second row (Hierarchy).\nTip Some of the new PowerPoint 2010 layouts allow you to insert pictures of people\nas well as their names.\n11. Display the SmartArt Styles gallery, and after previewing the available styles,\nunder 3-D, click the last thumbnail in the first row (Cartoon).\n206 Chapter 8 Fine-Tune Visual Elements\n12. Andy Ruth is an assistant, not a manager, so select his background shape, and on\nthe Format tab, in the Shape Styles group, click the Shape Fill arrow. Then under\nTheme Colors in the palette that appears, click the tan box (Tan, Text 2).\n13. Click the Florian Stiller shape (not the text), and then in the Shapes group, click\nthe Larger button three times.\nTroubleshooting Be sure to click the border of the shape. Otherwise, you will select\nthe text for editing instead of the shape itself.\nThe background shape grows with the selected shape.\n14. In the Shape Styles group, click the Shape Fill arrow, and then in the palette,\nclick the third box in the fifth column (Gray-50%, Accent 1, Lighter 40%)\n15. Display the WordArt Styles gallery, explore the options, and then click the third\nthumbnail in the first row (Fill – White, Drop Shadow).\nThe text in the shape is now a contrasting color.\n16. Click outside the diagram frame.\nYou can now see the final result.\nThe number of employees that you want to include in an organization chart often determines\nwhich layout you choose.\nCLEAN UP Save the ReorganizationMeeting presentation, and then close it.\nFormatting Charts 207\nFormatting Charts\nYou already know how to plot data in simple charts and how to edit that data in the\nassociated Microsoft Excel worksheet. Often, you will need nothing more than these\nbasic techniques to be able to convey your numeric data in a visual format. However,\nfor those times when you need more than a basic chart, PowerPoint provides formatting\ncapabilities that enable you to produce just the effect you want.\nIf you decide that the type of chart you selected doesn’t adequately depict the most\nimportant characteristics of your data, you can change the type at any time. There are\n11 chart types, each with two-dimensional and three-dimensional variations, and you\ncan customize each aspect of each variation. Common chart types include the following:\n● Column charts Used to show how values change over time.\n● Bar charts Used to show the values of several items at one point in time.\n● Line graphs Used to show erratic changes in values over time.\n● Pie charts Used to show how parts relate to the whole.\nIf you don’t want to spend a lot of time on a chart, you can apply the predefined com-\nbinations of formatting from the Chart Layouts and Chart Styles groups on the Design\ncontextual tab to create sophisticated charts with a minimum of effort. However, if you\nwant more control over the appearance of your chart, you can use the options on the\nLayout and Format contextual tabs. It is worth exploring these options so that you know\nhow to do the following:\n● Add shapes and pictures.\n● Format individual elements such as titles, axes, data labels, and gridlines.\n● Add trend lines, bars, and other lines.\n● Customize the walls and floor or otherwise manipulate a three-dimensional chart.\n● Customize the look of shapes.\n● Add and format fancy text (WordArt).\n● Arrange objects precisely.\n● Precisely control the overall size of the chart.\nYou can double-click almost any chart object to change its attributes. For example, you\ncan double-click an axis to display the Format Axis dialog box, where you can change\nthe scale, tick marks, label position, line style, and other aspects of the axis. If you have\ntrouble double-clicking some of the smaller chart elements, you can select the element\nyou want to format from the Chart Elements list in the Current Selection group on the\n208 Chapter 8 Fine-Tune Visual Elements\nFormat tab, and then click the Format Selection button in the same group to display the\nFormat dialog box for the selection.\nIf you make extensive modifications, you might want to save the customized chart as a\ntemplate so that you can use it for plotting similar data in the future without having to\nrepeat all the changes.\nIn this exercise, you’ll modify the appearance of a chart by changing its chart type and\nstyle. You’ll change the color of the plot area and the color of two data series. You’ll then\nhide gridlines and change the layout to display titles and a datasheet. After adding an\nannotation in a text box, you’ll save the chart as a template.\nSET UP You need the LandscapingChart_start presentation located in your Chapter08\npractice file folder to complete this exercise. Open the LandscapingChart_start presen-\ntation, and save it as LandscapingChart. Then follow the steps.\n1. Display slide 14, and click the blank area above the chart legend to activate the\nchart without selecting any of its elements.\nTroubleshooting Be sure to click a blank area inside the chart frame. Clicking any of its\nelements will activate that element, not the chart as a whole.\nPowerPoint displays the Design, Layout, and Format contextual tabs.\n2. On the Design contextual tab, in the Type group, click the Change Chart Type\nbutton.\nThe Change Chart Type dialog box opens.\nEach chart category provides several different design options.\nFormatting Charts 209\n3. In the gallery on the right, under Line, double-click the fourth thumbnail (Line\nwith Markers).\nThe column chart changes to a line chart, which depicts data by using colored lines\ninstead of columns.\nThe temperature data plotted as a line chart.\n4. In the Chart Styles group, click the More button.\nThe Chart Styles gallery appears.\nYou can quickly switch to a different color scheme or data marker style.\n5. In the gallery, click the last thumbnail in the fourth row (Style 32).\nThe lines are now thicker, and the data markers are three-dimensional.\n210 Chapter 8 Fine-Tune Visual Elements\n6. Move the pointer over the chart, and when a ScreenTip indicates you are\npointing to the plot area, click to select it.\nThe plot area is the area between the axes that contains the data markers.\n7. On the Format contextual tab, in the Shape Styles group, click the Shape Fill\narrow, and then in the list, click More Fill Colors.\nThe Colors dialog box opens.\nWhen none of the theme or standard colors meets your needs, you can pick a color\nin the Colors dialog box.\n8. On the Standard page, click the pale yellow below and to the left of the center,\nand then click OK.\nThe plot area is now a pale yellow shade to distinguish it from the rest of the chart.\nTip To change several aspects of the plot area, right-click the area and then click Format\nPlot Area to open the Format Plot Area dialog box. You can then change the fill, border,\nshadow, and 3-D format in one location.\nFormatting Charts 211\n9. At the top of the Current Selection group, click the Chart Elements arrow, and\nthen in the list, click Series “Maximum”.\nTip If you have trouble selecting an element of the chart by clicking it, you can choose\nit from the Chart Elements list.\nAn outline appears around the data points of the selected series.\n10. In the Current Selection group, click the Format Selection button.\nThe Format Data Series dialog box opens.\nYou can change several aspects of the selected data series in this dialog box.\n11. In the left pane, click Marker Fill, and on the Marker Fill page, click Solid Fill. In\nthe Fill Color area, click the Color button, and under Standard Colors, click the\nfirst box (Dark Red).\n12. In the left pane, click Line Color. Then on the Line Color page, click Solid line,\nand change the color to the same dark red.\n212 Chapter 8 Fine-Tune Visual Elements\n13. Repeat step 12 for the marker line color, and then click Close.\nThe Maximum data series is now represented by the dark red color.\n14. On the Layout tab, in the Axes group, click the Gridlines button, point to Primary\nHorizontal Gridlines, and then click None to remove the horizontal gridlines from\nthe chart.\n15. On the Design contextual tab, in the Chart Layouts group, click the More button.\nThe Chart Layouts gallery appears.\nYou can quickly change the layout of the chart by selecting one of the predefined options.\n16. In the gallery, click the first thumbnail in the second row (Layout 4).\nThe legend now appears below the chart.\nThe plot area has expanded to occupy the area vacated by the legend.\nFormatting Charts 213\nTip When you don’t have a lot of data, choosing a layout that includes a datasheet—a\ntable with all the values plotted in the chart—can clarify without adding clutter. In this\ncase, we have too much data to add a datasheet.\n17. On the Layout contextual tab, in the Insert group, click the Text Box button.\n18. Point below the chart title and above the July maximum temperature, and then\ndrag diagonally down and to the right until the text box stretches as far as the\nDecember data.\n19. Type Hot periods can last several days. Then select the text, and on the Home\ntab, in the Font group, change the size to 10 points and the color to Red.\n20. Click a blank area within the chart frame to release the text box selection.\nYou can now see the results.\nThe annotated chart.\n21. On the Design contextual tab, in the Type group, click the Save As Template\nbutton.\nThe Save Chart Template dialog box opens and displays the contents of your Charts\nfolder, which is a subfolder of your Templates folder.\nTroubleshooting If the Charts folder does not appear in the Address bar, navigate to\nthe AppData\\Roaming\\Microsoft\\Templates\\Charts folder under your user profile.\n22. With the Charts folder displayed in the Address bar, type Temperature By\nMonth in the File name box, and then click Save.\n214 Chapter 8 Fine-Tune Visual Elements\n23. In the Type group, click the Change Chart Type button, and then in the left\npane of the Change Chart Type dialog box, click Templates. Then point to the\nicon under My Templates in the left pane.\nA ScreenTip identifies this template as the one you just created.\nIn the future, you can click the custom template to create a chart with the same layout\nand formatting.\nTip To delete a custom chart template, click Manage Templates in the lower-left corner\nof the Change Chart Type dialog box, and then when Windows Explorer opens with\nyour Charts folder displayed, right-click the template and click Delete. Confirm that you\nwant to delete the template by clicking Yes, close Windows Explorer, and then close the\nChange Chart Type dialog box.\n24. Click Cancel to close the dialog box.\nCLEAN UP If you don’t want to keep the chart template, delete it by following the\ndirections in the preceding tip. Then save and close the LandscapingChart presentation.\nArranging Graphics\nAfter inserting pictures or drawing shapes in the approximate locations you want them\non a slide, you can align them and change their stacking order by clicking the buttons in\nthe Arrange group on the Format contextual tab.\nArranging Graphics 215\nClicking the Align button gives you access to commands for aligning individual or\nmultiple graphics in several ways. For example, you can:\n● Align graphics vertically by the left or right edges or centerline, or horizontally\nby the top or bottom edges or centerline.\n● Distribute graphics evenly within their current space, either horizontally or\nvertically.\n● Align graphics relative to the slide that contains them or to other selected objects.\n● Align graphics relative to a position on the slide.\n● Align graphics against gridlines and adjustable horizontal and vertical guides.\nTip If you added pictures to a slide by clicking the Picture button in the Images group on the\nInsert tab, you can group them and then align and position them as a group the same way\nyou would group shapes. However, if you have added them by clicking the Insert Picture From\nFile button in a content placeholder, you cannot group them. For information about grouping\nshapes, see “Drawing Shapes” in Chapter 5, “Add Simple Visual Enhancements.”\nWhen graphics overlap each other, they are stacked. The stacking order is determined\nby the order in which you inserted the graphic. You can change the stacking order by\nselecting a graphic and then clicking the Bring Forward or Send Backward button to\nmove the graphic to the top or bottom of the stack. To move the selected graphic forward\nin the stack one graphic at a time, click the Bring Forward arrow and then click Bring To\nFront in the list; to move it backward, click Send To Back in the Send Backward list.\nTip If you can’t select a graphic because it is covered by others in the stack, click the Selection\nPane button to display the Selection And Visibility task pane, and then select the graphic you\nwant from the Shapes On This Slide list.\nIn this exercise, you’ll align graphics in various ways, change their stacking order, and\nposition them with the help of a grid and guidelines.\nSET UP You need the GardenResidents_start presentation located in your Chapter08\npractice file folder to complete this exercise. Open the GardenResidents_start presen-\ntation, and save it as GardenResidents. Then follow the steps.\n1. On slide 1, select the three pictures.\n2. On the Format contextual tab, in the Arrange group, click the Align button, and\nthen in the list, click Distribute Vertically.\nThe middle picture moves down so that it is the same distance below the left\npicture as it is above the right picture.\n216 Chapter 8 Fine-Tune Visual Elements\n3. In the Arrange group, click the Align button, and then click Align Center.\nThe pictures are now stacked on top of each other.\nSometimes graphics are completely hidden when they are stacked.\n4. Click away from the stack, and then click the top picture.\n5. In the Arrange group, click the Bring Forward arrow, and then click\nBring to Front.\nThe top picture moves forward in the stack, obscuring the middle picture.\n6. In the Arrange group, click the Selection Pane button.\nThe Selection And Visibility task pane opens.\nArranging Graphics 217\nThe top and middle pictures are designated as content placeholders because\nthey were inserted into placeholders.\n7. In the task pane, under Shapes on this Slide, click Content Placeholder 10.\nOn the slide, the selection rectangle indicates that the middle picture is selected.\n8. Close the Selection and Visibility task pane.\n9. In the Arrange group, click the Bring Forward button.\nThe middle picture moves forward in the stacking order.\n10. In the Arrange group, click the Align button, and then click View Gridlines.\nA faint dotted grid appears on the slide.\n11. Drag the selected cat picture to the right and down, so that its right and bottom\nborders align with the first gridlines from the right and bottom edges of the slide.\n12. Drag the crow picture so that its right and bottom borders align with the second\ngridlines from the right and bottom edges of the slide.\n218 Chapter 8 Fine-Tune Visual Elements\n13. Drag the frog picture so that its right and bottom borders align with the third\ngridline from the right and bottom edges of the slide.\nThe pictures are now evenly stacked and spaced.\nGridlines make it easier to precisely align multiple graphics.\n14. In the Arrange group, click the Align button, and then click Grid Settings.\nThe Grid And Guides dialog box opens.\nIn this dialog box, you specify the size of the grid and other options.\nArranging Graphics 219\n15. In the Grid settings area, clear the Display grid on screen check box.\n16. In the Guide settings area, select the Display drawing guides on screen check\nbox, and then click OK.\nThe grid disappears, and vertical and horizontal guides span the slide.\n17. Point to the vertical guide away from any text or objects, and drag it to the left,\nreleasing it when the accompanying ScreenTip reads 3.50. Then drag the horizontal\nguide down until its ScreenTip reads 0.50.\nTroubleshooting If you move an object on the slide instead of a guide, click the Undo\nbutton, and then point outside the margins of the slide to drag the guide.\nThe ScreenTips show in inches how far each guide is from the 0 mark in the center\nof the slide. As you drag, numbers are skipped because the Snap Objects To Grid\ncheck box is selected in the Grid And Guides dialog box.\nTip The Snap Objects To Grid option snaps guides and graphics to an invisible grid. You\ncan turn off this option, and you can set the spacing of the grid in the Grid And Guides\ndialog box.\n18. Point to the selected frog picture, and drag it to the left until its left and bottom\nborders align with the guides.\n19. Select all the pictures. Then on the Format tab, in the Arrange group, click the\nAlign button, and in the list, click Distribute Horizontally.\n20. Repeat step 19 to distribute the pictures vertically.\n21. In the Arrange group, click the Align button, click Grid Settings, and in the Grid\nand Guides dialog box, clear the Display drawing guides on screen check box.\nThen click OK.\n22. Click the shape behind the pictures, and drag the green rotating handle clockwise\nuntil the shape stretches diagonally across the slide. Then drag the shape’s middle\nsizing handles until it is almost as wide as the pictures.\n23. With the shape still selected, in the Arrange group, click the Send Backward\narrow, and click Send to Back.\nThe shape now sits behind the slide title as well as the pictures.\n24. On the View Shortcuts toolbar in the lower-right corner of the program window,\nclick the Reading View button.\nYou can now see what the slide will look like during presentation delivery.\n220 Chapter 8 Fine-Tune Visual Elements\nThe finished slide in Reading view.\nCLEAN UP Save the GardenResidents presentation, and then close it.\nAlt Text\nAlt (alternate) text is a title and description associated with a graphic object that\nenables people with vision or other impairments to determine what the object is.\nYou can add alt text to your objects to improve the accessibility of presentations\nthat will be viewed on the screen without a presenter.\nTo associate alt text with an object:\n1. Right–click the object, and click the corresponding Format command.\n2. In the left pane of the Format dialog box, click Alt Text.\nThe Alt Text page is displayed.\n3. Enter a title and a description for the graphic object, and then click Close.\nKey Points 221\nKey Points\n● A growing trend among presenters is to create graphic-intensive rather than text-\nintensive presentations.\n● If you want to move beyond simple diagrams, you need to know how to\nmanipulate levels of text in shapes and how to format individual shapes as\nwell as the diagram as a whole.\n● With all the sophisticated chart formatting tools PowerPoint provides, it is\nimportant to remember that to be effective, charts need to be simple enough\nfor people to grasp key trends at a glance.\n● Knowing how to manipulate graphics on a slide will help you position, align,\nand stack them to get the effect you want.\nChapter at a Glance\nInsert and play sounds,\npage 263\nInsert and play videos,\npage 268\n11\nAdd Sound and\nMovies\nIn this chapter, you will learn how to\n✔ Insert and play sounds.\n✔ Insert and play videos.\nA Microsoft PowerPoint presentation is usually created to convey a lot of information\nin a short time. That information can be in the form of text, graphics, charts, and tables,\nbut it might also consist of audio content. And sometimes the best way to ensure that\nyour audience understands your message is to show a video. For example, if your com-\npany has developed a short advertising video, it makes more sense to include the video\nin a presentation about marketing plans than to try and describe it with bullet points or\neven pictures.\nIn this chapter, you’ll insert a sound clip and a sound file and make various adjustments\nto their settings. You’ll also insert two video files, edit one of them, and format them both.\nPractice Files Before you can complete the exercises in this chapter, you need to copy\nthe book’s practice files to your computer. The practice files you’ll use to complete\nthe exercises in this chapter are in the Chapter11 practice file folder. A complete list of\npractice files is provided in “Using the Practice Files” at the beginning of this book.\nInserting and Playing Sounds\nIn “Adding Transitions” in Chapter 5, “Add Simple Visual Enhancements,” you added\nsound to a slide transition. You can also insert the following types of sounds:\n● Audio files You can insert an audio file—for example, a speech or interview—by\nclicking the Audio button in the Media group on the Insert tab, and then selecting\nthe file.\n263\n264 Chapter 11 Add Sound and Movies\n● Sound clips You can insert a sound clip by clicking the Audio arrow in the Media\ngroup on the Insert tab, and then clicking Clip Art Audio to display the Clip Art task\npane, where you can search for and select the sound you want. Clicking Find More\nAt Office.com at the bottom of the task pane takes you to the Office.com Web site,\nwhere you can search for additional sounds.\nSee Also For information about using the Clip Art task pane, see “Inserting Pictures and\nClip Art Images” in Chapter 5, “Add Simple Visual Enhancements.”\n● Recorded sounds You can record a sound or narration and attach it to a slide, all\nfrom within PowerPoint.\nSee Also For information about recording sounds, see the sidebar “Recording\nPresentations” in Chapter 14, “Prepare for Delivery.”\nAfter you add a sound object, it appears on the slide represented by an icon. When the\nsound object is selected, a play bar appears below its icon with controls for playing the\nsound, and PowerPoint adds Format and Playback contextual tabs to the ribbon. You\ncan change the icon as follows:\n● Drag the object to locate it anywhere on the slide.\n● Drag its sizing handles to make it larger or smaller.\n● Use commands on the Format tab to change its appearance, in much the same\nway that you would format a picture.\n● Click the Change Picture button to replace the default icon with a picture.\nYou can modify the sound itself on the Playback tab, as follows:\n● Click the Trim Audio button in the Editing group to edit the sound so that only\npart of it plays.\n● Specify Fade In and Fade Out settings to have the sound gradually increase and\ndecrease in volume.\n● Click the Volume button to adjust the volume to Low, Medium, or High, or to\nmute the sound.\n● Specify whether the sound plays:\n❍ Automatically when the slide appears.\n❍ Only if you click its icon.\n❍ Throughout the presentation.\nInserting and Playing Sounds 265\n● Select the Hide During Show check box to make the sound object invisible while\nthe presentation is displayed in Reading view or Slide Show view.\n● Select the Loop Until Stopped check box to have the sound play continuously until\nyou stop it.\n● Select the Rewind After Playing check box to ensure that the sound starts from the\nbeginning each time it is played.\nTo play a sound, you must have a sound card and speakers installed. In Normal view, you\ncan test the sound associated with a slide by clicking its icon and then either clicking the\nPlay/Pause button on its play bar or clicking the Play button in the Preview group on the\nPlayback contextual tab.\nIn this exercise, you’ll insert a sound clip into a slide, adjust the position of the sound\nobject, change its picture, and make various other adjustments to its settings. Then you’ll\ninsert an audio file into another slide and make the file play continuously throughout a\npresentation.\nSET UP You need the HealthyEcosystemsA_start and AGKCottage_start presentations,\nthe Bird picture, and the Amanda audio file located in your Chapter11 practice file\nfolder. Open the AGKCottage_start presentation, and save it as AGKCottage. Then\nopen the HealthyEcosystemsA_start presentation, and save it as HealthyEcosystemsA.\nBe sure to turn on your computer’s speakers for this exercise. (If you do not have a\nsound card and speakers, you can still follow the steps, but you won’t be able to hear\nthe sound.) With HealthyEcosystemsA displayed on your screen, follow the steps.\n1. On the Insert tab, in the Media group, click the Audio arrow, and then click Clip\nArt Audio.\nThe Clip Art task pane opens, displaying thumbnails of common sound clips.\n2. In the Search for box, type birds, and then click Go.\nThe task pane now displays thumbnails of bird calls.\n3. Click any thumbnail, click the arrow that appears, and then click Preview/\nProperties.\n266 Chapter 11 Add Sound and Movies\nThe Preview/Properties dialog box for the sound clip you selected opens.\nWhen you display this dialog box, PowerPoint downloads and plays the sound clip.\nTroubleshooting The sound clips available from Office.com change frequently, so\ndon’t worry if you don’t see the Birds At Dawn clip in your Clip Art task pane. Just use\na different clip.\n4. Click Close to close the dialog box, and continue previewing sound clips.\n5. When you are ready, double-click a sound clip that you think is appropriate for the\nslide, and then close the Clip Art task pane.\nWe chose Birds Singing. A small speaker icon representing the sound object\nappears in the middle of the slide, along with a play bar. It is hard to see the icon\nbecause it is on top of the picture.\n6. Drag the sound object to the upper-left corner of the slide.\nThe play bar moves with the sound object.\nInserting and Playing Sounds 267\nThe handles around the sound object indicate that you can resize it, just like any other object.\n7. On the play bar, click the Play/Pause button to hear the sound.\nThe sound plays. Now let’s change the picture associated with the object.\n8. With the sound object selected, on the Format contextual tab, in the Adjust\ngroup, click the Change Picture button. Then in the Insert Picture dialog box,\ndouble-click the Bird picture in your Chapter11 practice file folder.\n9. On the Playback contextual tab, in the Audio Options group, display the Start\nlist, and click Automatically. Then select the Loop until Stopped check box.\n10. On the View Shortcuts toolbar, click the Reading View button.\nPowerPoint plays the sound clip.\n11. Move the pointer over the bird representing the sound object, and when the play\nbar appears, click the Play/Pause button. Then press the Esc key to return to\nNormal view.\n12. Display the AGKCottage presentation, and view it in Reading view, pressing Esc\nafter a few slides.\nThis presentation would benefit from a “sound track.”\n268 Chapter 11 Add Sound and Movies\n13. With slide 1 displayed, on the Insert tab, in the Media group, click the Audio\nbutton. Then in the Insert Audio dialog box, double-click the Amanda file in\nyour Chapter11 practice file folder.\n14. On the Playback tab, In the Audio Options group, display the Start list, and\nthen click Play across slides. Then select the Hide During Show and Loop until\nStopped check boxes.\n15. Switch to Reading view.\nThe audio file plays while PowerPoint moves from slide to slide.\n16. Press Esc to stop the presentation and return to Normal view.\nCLEAN UP Save and close the HealthyEcosystemsA and AGKCottage presentations.\nInserting and Playing Videos\nIn keeping with the trend toward more visual presentations, PowerPoint 2010 has new\nvideo capabilities that broaden the range of videos you can use and what you can do\nwith them. You can insert the following types of movies in slides:\n● Video files You can insert a digital video that has been saved as a file in one of\ntwo ways: If a slide’s layout includes a content placeholder, you can click the Insert\nMovie Clip button in the placeholder. You can also click the Video button in the\nMedia group on the Insert tab. Either way, the Insert Video dialog box opens so\nthat you can select the file.\n● Videos from Web sites For information, see the sidebar “Inserting Videos from\nWeb Sites” later in this chapter.\n● Clip art videos Clip art videos are animated graphics, rather than real videos.\nClicking the Video arrow in the Media group on the Insert tab and then clicking\nClip Art Video displays the Clip Art task pane, where you can search for and select\nthe clip you want. Clicking Find More At Office.com at the bottom of the task pane\ntakes you to the Microsoft Office Online Web site, where you can search for ad-\nditional clips. When you insert a clip art video, it appears as a picture on the slide,\nand PowerPoint adds a Format contextual tab to the ribbon so that you can adjust\nthe way the picture looks. The clip moves only when you display the slide in Reading\nview or Slide Show view, and you cannot adjust its action.\nSee Also For information about using the Clip Art task pane, see “Inserting Pictures and\nClip Art Images” in Chapter 5, “Add Simple Visual Enhancements.”\nInserting and Playing Videos 269\nBoth video files and videos from Web sites appear on the slide as video objects that you\ncan size and move to meet your needs. When you select a video object, PowerPoint adds\nFormat and Playback contextual tabs to the ribbon. You can change the way the object\nappears on the slide as follows:\n● Drag the object to locate it anywhere on the slide.\n● Drag its sizing handles to make it larger or smaller.\n● Use commands on the Format tab to change its appearance, in much the same way\nthat you would format a picture.\nYou can modify the video itself on the Playback tab, as follows:\n● Click the Trim Video button in the Editing group to edit the video so that only part\nof it plays.\nTip You can find out the total playing time of a video by displaying the Trim Video\ndialog box.\n● Specify Fade In and Fade Out settings to have the video gradually appear and\ndisappear.\n● Click the Volume button to adjust the volume to Low, Medium, or High, or to mute\nthe sound.\n● Specify whether the video plays:\n❍ Automatically when the slide appears.\n❍ Only if you click the object.\n● Select the Play Full Screen check box to have the video occupy the entire slide\nspace while playing.\n● Select the Hide While Not Playing check box to make the video object invisible\nwhile the presentation is displayed in Reading view or Slide Show view.\n● Select the Loop Until Stopped check box to have the video play continuously until\nyou stop it.\n● Select the Rewind After Playing check box to ensure that the video starts from the\nbeginning each time it is played.\nIn Normal view, you can test the video associated with a slide by clicking the video\nobject and then either clicking the Play/Pause button on its play bar or clicking the\nPlay button in the Preview group on the Playback contextual tab.\nIn this exercise, you’ll insert two videos into a slide, adjust the size of their objects,\nformat the objects, and make various other adjustments to their settings.\n270 Chapter 11 Add Sound and Movies\nSET UP You need the HealthyEcosystemsB_start presentation and the Butterfly\nand Wildlife video files located in your Chapter11 practice file folder. Open the\nHealthyEcosystemsB_start presentation, and save it as HealthyEcosystemsB. Then\nfollow the steps.\n1. In the Slide pane, in the left content placeholder, click the Insert Media Clip\nbutton.\n2. In the Insert Video dialog box, double-click the Butterfly file in your Chapter11\npractice file folder.\nThe video is inserted as an object in the content placeholder with a play bar below it.\nThe play bar is similar to the one for a sound object.\n3. On the play bar, click the Play/Pause button to watch the video.\nInserting and Playing Videos 271\n4. Repeat steps 1 through 3 to insert the Wildlife video in the right content place-\nholder, and then play the video.\nLet’s trim this video so that it shows only the animal that looks like a big ground\nsquirrel.\n5. With the Wildlife video selected, on the Playback contextual tab, in the Editing\ngroup, click the Trim Video button.\nThe Trim Video dialog box opens.\nYou can advance through the video frame by frame to identify the start and end times.\n6. Drag the green start marker to the right until it sits at about the 00:17.020 mark.\nThen click the Next Frame button, pausing after each click, until the first ground\nsquirrel frame comes into view at the 00:17.288 mark.\n272 Chapter 11 Add Sound and Movies\n7. Drag the red stop marker to the left until it sits at about the 00:20.900 mark. Then\nclick the Next Frame button, pausing after each click, until the last ground squirrel\nframe comes into view at the 00:20.799 mark.\n8. Click OK. Then play the trimmed video.\n9. Click the Butterfly video object, and on the Format tab, in the Size group, click\nthe Height arrow until the object is 3 inches tall.\nThe width of the object increases proportionally. Let’s make the Wildlife object the\nsame size.\n10. Click the Wildlife object, and in the Size group, change its Height to 3.\nBecause this video object is now too wide, we need to crop it from the left.\n11. Right-click the object, and click Format Video. Then in the Format Video dialog\nbox, click the Crop tab.\nThe settings on this page take the trial-and-error out of any cropping task.\nThe Crop page of the Format Video dialog box.\n12. In the Crop position area, change the Width setting to 4”. Then click Close.\nInserting and Playing Videos 273\n13. Drag the objects until they are evenly spaced on the slide, using the Align com-\nmands in the Arrange group as necessary to line them up.\n14. With both objects selected, click the More button in the Video Styles group.\nThe Video Styles gallery appears.\nYou can select a frame for the video from this gallery.\nTip In addition to formatting a video with a ready-made video style, you can choose\nfrom the Video Shape, Video Border, and Video Effects galleries to create your own\ncombinations. Just be careful not to overdo it.\n15. Under Intense, click the fifth thumbnail in the first row (Reflected Bevel, Black).\nThen click away from the objects.\n274 Chapter 11 Add Sound and Movies\nYou can now see the results.\nThe two video objects have rounded frames and reflections.\n16. Click the Butterfly object, and on the Playback contextual tab, in the Video\nOptions group, click the Volume button, and then click Mute.\n17. In the Video Options group, display the Start list, and click Automatically. Then\nselect the Loop until Stopped check box.\n18. Click the Wildlife object, set Volume to Mute, leave Start set to On Click, and\nselect the Loop until Stopped check box.\n19. Switch to Reading view, and preview and pause the Butterfly video. Then preview\nand pause the Wildlife video.\n20. Press Esc twice to return to Normal view.\nCLEAN UP Close the HealthyEcosystemsB presentation without saving your changes.\nInserting and Playing Videos 275\nInserting Videos from Web Sites\nIf you find a video on a public Web site that you want to use to illustrate a point in\na presentation, you might be able to insert a link to the video into a slide. The for-\nmat of the video must be supported by Windows Media Player, and the owner of\nthe video must have made it available to the public. You can tell which videos are\npublicly available by right-clicking the video and looking for a Copy Embed HTML\ncommand. If you do not see this command, the owner has secured the video, and\nyou cannot play it from anywhere but the site on which it is published.\nTo insert a link to a video on a Web site:\n1. Display the video, right-click it, and then click Copy Embed HTML.\n2. Display the slide into which you want to insert the video.\n3. On the Insert tab, in the Media group, click the Video arrow, and then click\nVideo From Web Site.\nThe Insert Video From Web Site dialog box opens.\n4. In the dialog box, click in the text box, and then press Ctrl+V (the keyboard\nshortcut for the Paste command).\nThe copied embed code is inserted at the cursor.\nA link to a video available from YouTube.\n5. Click OK.\nTo view the video, switch to Reading view or Slide Show view, and then click the\nPlay/Pause button. PowerPoint then uses the embed code to locate and play the\nvideo. Provided the video remains available in its original location, and provided\nyou have an active Internet connection, you will be able to access and play the\nvideo from the slide at any time.\n\n\nContents\nIntroducing Microsoft Access 2010............................................ ix\nModifying the Display of the Ribbon..........................................xv\nFeatures and Conventions of This Book....................................... xxi\nUsing the Practice Files.................................................... xxiii\nYour Companion eBook.................................................... xxiv\nGetting Help..............................................................xxv\nSimple Database Techniques 1\nPart 1\n1 Explore an Access 2010 Database 3\nWorking in Access 2010 ....................................................4\nSidebar: Enabling Macros and Other Database Content...................14\nUnderstanding Database Concepts .........................................16\nExploring Tables..........................................................17\nSidebar: Tabbed Pages vs. Overlapping Windows........................22\nExploring Forms..........................................................24\nExploring Queries ........................................................29\nExploring Reports ........................................................33\nPreviewing and Printing Access Objects .....................................38\nKey Points...............................................................43\n2 Create Databases and Simple Tables 45\nCreating Databases from Templates ........................................46\nSidebar: Web Databases..............................................51\nCreating Databases and Tables Manually ....................................52\nSidebar: Database Design.............................................60\nManipulating Table Columns and Rows......................................61\nRefining Table Structure...................................................64\nCreating Relationships Between Tables......................................69\nKey Points...............................................................75\nWhat do you think of this book? We want to hear from you!\nMicrosoft is interested in hearing your feedback so we can continually improve our books and learning resources\nfor you. To participate in a brief online survey, please visit:\nmicrosoft.com/learning/booksurvey\niii\niv Contents\n3 Create Simple Forms 77\nCreating Forms by Using the Form Tool .....................................78\nChanging the Look of Forms...............................................85\nChanging the Arrangement of Forms .......................................93\nKey Points...............................................................99\n4 Display Data 101\nSorting Information in Tables .............................................102\nSidebar: How Access Sorts...........................................106\nFiltering Information in Tables.............................................107\nFiltering Information by Using Forms ......................................111\nSidebar: Wildcards..................................................115\nLocating Information That Matches Multiple Criteria.........................115\nSidebar: Saving Filters as Queries.....................................119\nKey Points..............................................................119\n5 Create Simple Reports 121\nCreating Reports by Using a Wizard .......................................122\nModifying Report Design.................................................129\nPreviewing and Printing Reports ..........................................136\nKey Points..............................................................139\nRelational Database Techniques 141\nPart 2\n6 Maintain Data Integrity 143\nRestricting the Type of Data ..............................................144\nRestricting the Amount of Data ...........................................149\nRestricting the Format of Data ............................................151\nSidebar: Creating Custom Formats....................................158\nRestricting Data by Using Validation Rules..................................159\nSidebar: Simple Validation Tests ......................................166\nContents v\nRestricting Data to Values in Lists..........................................167\nSidebar: Multicolumn Lookup Lists....................................171\nRestricting Data to Values in Other Tables ..................................172\nSidebar: Multivalued Fields ..........................................177\nKey Points..............................................................177\n7 Create Custom Forms 179\nModifying Forms Created by Using a Wizard................................180\nAdding Controls.........................................................187\nAdding Subforms........................................................196\nSidebar: Different Types of Forms.....................................204\nUsing E-Mail Forms to Collect Data........................................205\nKey Points..............................................................207\n8 Create Queries 209\nCreating Queries by Using a Wizard .......................................210\nCreating Queries Manually ...............................................216\nUsing Queries to Summarize Data .........................................221\nUsing Queries to Perform Calculations .....................................224\nUsing Queries to Update Records..........................................231\nUsing Queries to Delete Records ..........................................235\nKey Points..............................................................239\n9 Create Custom Reports 241\nCreating Reports Manually ...............................................242\nModifying Report Content................................................247\nSidebar: Adding Hyperlinks, Charts, and Buttons .......................253\nAdding Subreports ......................................................254\nSidebar: Layouts....................................................260\nKey Points..............................................................261\nvi Contents\nDatabase Management and Security 263\nPart 3\n10 Import and Export Data 265\nImporting Information ...................................................266\nImporting from Other Access Databases...............................267\nImporting from Excel Worksheets ....................................268\nImporting from Text Files............................................268\nImporting from Other Database Programs.............................269\nImporting from Outlook Folders......................................269\nImporting from SharePoint Lists......................................269\nImporting from HTML Files ..........................................271\nImporting from XML Files ...........................................272\nSidebar: Linking to Information.......................................281\nExporting Information ...................................................282\nExporting to Other Access Databases .................................283\nExporting to Excel Worksheets .......................................283\nExporting to Word Documents.......................................283\nExporting to Text Files...............................................284\nExporting to PDF and XPS Files.......................................284\nExporting to SharePoint Lists.........................................285\nExporting to HTML Files.............................................285\nExporting to XML Files ..............................................285\nCopying to and from Other Office Programs................................292\nKey Points..............................................................295\n11 Make Databases User Friendly 297\nCreating Navigation Forms ...............................................298\nCreating Custom Categories ..............................................305\nControlling Which Features Are Available...................................309\nKey Points..............................................................313\nContents vii\n12 Protect Databases 315\nAssigning Passwords to Databases.........................................316\nSplitting Databases . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .320\nSecuring Databases for Distribution........................................323\nSidebar: Packaging and Signing Databases.............................326\nPreventing Database Problems............................................328\nKey Points..............................................................333\n13 Customize Access 335\nChanging Default Program Options........................................336\nSidebar: Using Add-Ins..............................................345\nCustomizing the Ribbon..................................................346\nCustomizing the Quick Access Toolbar .....................................351\nKey Points..............................................................355\nGlossary................................................................. 357\nKeyboard Shortcuts ....................................................... 363\nIndex.................................................................... 393\nAbout the Authors........................................................ 415\nWhat do you think of this book? We want to hear from you!\nMicrosoft is interested in hearing your feedback so we can continually improve our books and learning resources\nfor you. To participate in a brief online survey, please visit:\nmicrosoft.com/learning/booksurvey\n\nIntroducing Microsoft Access 2010\nMicrosoft Access 2010 is a powerful relational database program that includes hundreds\nof tools you can use to quickly start tracking, sharing, and reporting information, even\nif you are new to database development. Users have access to a large library of profes-\nsionally designed templates; wizards that automatically create tables, forms, queries,\nand reports; and extensive local and online help resources.\nAccess supports sharing data with other sources, including other Microsoft Office 2010\nprograms, Microsoft SQL Server, Windows SharePoint Services, and documents in XML,\nHTML, XPS, and PDF formats. Advanced features allow you to create sophisticated executable\ndatabase applications that your employees and customers can use to gather and view\ndata without needing to know anything at all about database design or development.\nThis book gives you straightforward instructions for using Access to create databases.\nIt takes you from knowing little or nothing about Access—or, for that matter, about\ndatabases—to a level of expertise that will enable you to create complex databases\nfor use by one person or by many people.\nNew Features\nIf you’re upgrading to Access 2010 from a previous version, you’re probably more\ninterested in the differences between the old and new versions and how they will\naffect you than you are in the basic functionality of Access. To help you identify the\nentire scope of changes from the version of Access you’re familiar with, we’ve listed\nhere the new features introduced in Access 2010, as well as in Access 2007.\nix\nx Introducing Microsoft Access 2010\nIf You Are Upgrading from Access 2007\nIf you have been using Access 2007, you might be wondering how Microsoft could have\nimproved on what seemed like a pretty comprehensive set of features and tools. In addition\nto enhancing many of the new features introduced with Access 2007, Access 2010 includes\nthe following new features:\n● The Backstage view Finally, all the tools you need to work with your files, as opposed\nto their content, really are accessible from one location. You display the Backstage\nview by clicking the File tab, which replaces the Microsoft Office Button at the left\nend of the ribbon.\n● Customizable ribbon The logical next step in the evolution of the command\ncenter introduced with Access 2007: Create your own tabs and groups to suit\nthe way you work.\n● Unifying themes Adding pizzazz to database objects such as forms and reports is\njust a matter of applying a professional-looking theme from a gallery of options.\n● Web capabilities Companies that have employees and clients in different geographic\nlocations can publish databases to Access Services, thereby making those databases\naccessible over the Internet in a Web browser.\n● Navigation forms Offering the sophisticated browsing techniques people are accus-\ntomed to using on Web sites, these new forms provide an essential navigation tool\nfor Web databases, and can also increase the usability of non-Web databases.\n● New database templates Getting started with the creation of common types of\ndatabases has never been easier. The databases that come with Access are supple-\nmented by those made available by a community of database developers through\nMicrosoft Office Online.\n● Application parts You can now add predefined database objects to an existing\ndatabase. In addition to 10 types of forms, several Quick Start parts are available.\nFor example, adding the Contacts part adds one table and associated queries,\nforms, and reports.\n● Enhanced Layout view and layout controls It is now easier to make design changes\nin Layout view while actively viewing the underlying data.\n● Enhanced Expression Builder The layout of the Expression Builder dialog box has\nbeen refined to make building an expression more intuitive. In addition, a feature\ncalled IntelliSense has been incorporated to display options based on what you\ntype and to provide syntax guidance.\nIntroducing Microsoft Access 2010 xi\n● Improved conditional formatting You can now use data bars to add at-a-glance\ninsight into the data in Number fields.\n● Ability to export to PDF and XPS files When you want to make a report or other\ndatabase object available to people but don’t want them to be able to manipulate\nit, you can export the object in either PDF or XPS format. You can optimize the file\nsize for printing or publishing online.\nIf You Are Upgrading from Access 2003\nAccess 2010 builds on Access 2007, which introduced a long list of new and improved\nfeatures that made it easier than ever to create databases to track, share, manage, and\naudit information, including the following:\n● The ribbon The new user interface organizes the most common commands for\nany database object into tabs and groups so that the appropriate commands are\nimmediately accessible for the current object.\n● Quick Access Toolbar Customize a portion of the toolbar to include commands\nyou regularly use, regardless of which object is currently active.\n● Navigation pane The customizable Navigation pane replaces the Database window\nfrom Access 2003. You can display or hide all tables, queries, forms, reports, macros,\nand modules, or create a custom group that displays only the objects you want to\nwork with at the moment. You can even hide the Navigation pane to make more\nroom on the screen for your database object.\n● View Shortcuts toolbar This context-sensitive toolbar at the lower-right corner of\nthe program window provides single-click switching among the supported views\nof the current database object. Quickly switch between Datasheet view, Design\nview, PivotTable view, PivotChart view, Form view, Layout view, Report view, and\nother views appropriate to the current object.\n● Tabbed documents Open multiple database objects and switch between them\nquickly by clicking tabs on a tab bar.\n● Template library Quickly locate and download professionally designed templates\nfor common database projects.\n● Improved sorting and filtering Easily sort all records in a table based on one or\nmore fields, or filter a table or form to display or hide records matching multiple\ncriteria.\nxii Introducing Microsoft Access 2010\n● Layout view Redesign a form or report while viewing it.\n● Stacked and Tabular layouts Group controls in a form or report layout so you\ncan easily manipulate the entire group as one unit.\n● Automatic calendar The Date/Time data type includes an optional calendar\ncontrol. Click the calendar, and select the date you want.\n● Rich Text Memo fields now support most common formatting options, including\nfonts, color, and character formatting. The formatting is stored with the database.\n● Create tab Quickly create a new table, form, query, report, macro, SharePoint list,\nor other Access object.\n● Totals function Add a totals row to a query, and select from a list of formulas to\nautomatically calculate aggregate values for forms and reports.\n● Field List Drag and drop fields from one or more related or unrelated tables onto\nyour active table.\n● Attachment data type Attach photos and other files to a database record.\n● Embedded macros Macros embedded in a form or report offer a higher level\nof security in database applications.\n● Microsoft Access Help Easily search end-user and developer help content from\nwithin Access.\n● Improved information sharing Easily import and export data between Access and\nother Office applications or XML, HTML, PDF, and dBase files; collect information\nthrough e-mail surveys in Microsoft Office Outlook and automatically update your\ndatabase with the responses; create or link a database with a SharePoint list; or pub-\nlish your database to a SharePoint library and allow users to update and extract\ninformation.\n● Improved report design Quickly create a professional-looking report, complete with\nlogo, header, and footer; and use Report view, combined with filters, to browse only\nselected records in the report.\n● Group, Sort, and Total pane This feature makes it much easier to group and sort\ndata in reports, and add totals from a drop-down list.\n● Enhanced security Adding password protection to a database now causes Access\nto automatically encrypt the database when it closes, and decrypt it when it\nopens.\nIntroducing Microsoft Access 2010 xiii\nLet's Get Started!\nThere are so many new and improved features to this already feature-rich program\nthat there are bound to be some exciting discoveries for even the most advanced users.\nIf you are new to Access, you will find many automated features that let you painlessly\ncreate databases and add queries, forms, and professional-looking reports to track and\nshare your data. We look forward to showing you around Microsoft Access 2010.\n\nModifying the Display of the Ribbon\nThe goal of the Microsoft Office 2010 working environment is to make working with Office\nfiles—including Microsoft Word documents, Excel workbooks, PowerPoint presentations,\nOutlook e-mail messages, and Access databases—as intuitive as possible. You work with\nan Office file and its contents by giving commands to the program in which the docu-\nment is open. All Office 2010 programs organize commands on a horizontal bar called\nthe ribbon, which appears across the top of each program window whether or not there\nis an active document.\nRibbon tabs Ribbon groups\nA typical program window ribbon.\nCommands are organized on task-specific tabs of the ribbon, and in feature-specific\ngroups on each tab. Commands generally take the form of buttons and lists. Some appear\nin galleries in which you can choose from among multiple options. Some groups have\nrelated dialog boxes or task panes that contain additional commands.\nThroughout this book, we discuss the commands and ribbon elements associated with\nthe program feature being discussed. In this section, we discuss the general appearance\nof the ribbon, things that affect its appearance, and ways of locating commands that\naren’t visible on compact views of the ribbon.\nSee Also For detailed information about the ribbon in Microsoft Access, see “Working\nin Access 2010” in Chapter 1, “Explore an Access 2010 Database.”\nTip Some older commands no longer appear on the ribbon, but are still available in the\nprogram. You can make these commands available by adding them to the Quick Access\nToolbar. For more information, see “Customizing the Quick Access Toolbar” in Chapter 13,\n“Customize Access.”\nxv\nxvi Modifying the Display of the Ribbon\nDynamic Ribbon Elements\nThe ribbon is dynamic, meaning that the appearance of commands on the ribbon\nchanges as the width of the ribbon changes. A command might be displayed on the\nribbon in the form of a large button, a small button, a small labeled button, or a list\nentry. As the width of the ribbon decreases, the size, shape, and presence of buttons\non the ribbon adapt to the available space.\nFor example, when sufficient horizontal space is available, the buttons on the Review\ntab of the Word program window are spread out and you’re able to see more of the\ncommands available in each group.\nDrop-down list Small labeled button Large button\nThe Review tab of the Word program window at 1024 pixels wide.\nIf you decrease the width of the ribbon, small button labels disappear and entire groups\nof buttons are hidden under one button that represents the group. Click the group button\nto display a list of the commands available in that group.\nGroup button Small unlabeled buttons\nThe Review tab of the Word program window at 675 pixels wide.\nModifying the Display of the Ribbon xvii\nWhen the window becomes too narrow to display all the groups, a scroll arrow appears\nat its right end. Click the scroll arrow to display hidden groups.\nScroll arrow\nThe Review tab of the Word program window at 340 pixels wide.\nChanging the Width of the Ribbon\nThe width of the ribbon is dependent on the horizontal space available to it, which\ndepends on these three factors:\n● The width of the program window Maximizing the program window provides\nthe most space for ribbon elements. You can resize the program window by\nclicking the button in its upper-right corner or by dragging the border of a\nnon-maximized window.\nOn a computer running Windows 7, you can maximize the program window by\ndragging its title bar to the top of the screen.\n● Your screen resolution Screen resolution is the amount of information your screen\ndisplays, expressed as pixels wide by pixels high. The greater the screen resolution, the\ngreater the amount of information that will fit on one screen. Your screen resolution\noptions are dependent on your monitor. At the time of writing, possible screen reso-\nlutions range from 800 × 600 to 2048 × 1152. In the case of the ribbon, the greater\nthe number of pixels wide (the first number), the greater the number of buttons that\ncan be shown on the ribbon, and the larger those buttons can be.\nxviii Modifying the Display of the Ribbon\nOn a computer running Windows 7, you can change your screen resolution from\nthe Screen Resolution window of Control Panel.\nYou set the resolution by dragging the pointer on the slider.\n● The density of your screen display You might not be aware that you can change the\nmagnification of everything that appears on your screen by changing the screen mag-\nnification setting in Windows. Setting your screen magnification to 125% makes text\nand user interface elements larger on screen. This increases the legibility of informa-\ntion, but it means that less information fits onto each screen.\nOn a computer running Windows 7, you can change the screen magnification from\nthe Display window of Control Panel.\nSee Also For more information about display settings, refer to Windows 7 Step by Step\n(Microsoft Press, 2009), Windows Vista Step by Step (Microsoft Press, 2006), or Windows\nXP Step by Step (Microsoft Press, 2002) by Joan Lambert Preppernau and Joyce Cox.\nModifying the Display of the Ribbon xix\nYou can choose one of the standard display magnification options or create another by setting\na custom text size.\nThe screen magnification is directly related to the density of the text elements on\nscreen, which is expressed in dots per inch (dpi) or points per inch (ppi). (The terms\nare interchangeable, and in fact are both used in the Windows dialog box in which\nyou change the setting.) The greater the dpi, the larger the text and user interface\nelements appear on screen. By default, Windows displays text and screen elements\nat 96 dpi. Choosing the Medium - 125% display setting changes the dpi of text and\nscreen elements to 120 dpi. You can choose a custom setting of up to 500 percent\nmagnification, or 480 dpi, in the Custom DPI Setting dialog box.\nYou can choose a magnification of up to 200 percent from the lists, or choose a greater\nmagnification by dragging the ruler from left to right.\nxx Modifying the Display of the Ribbon\nAdapting Exercise Steps\nThe screen images shown in the exercises in this book were captured at a screen reso-\nlution of 1024 × 768, at 100% magnification, and with the default text size (96 dpi).\nIf any of your settings are different, the ribbon on your screen might not look the same\nas the one shown in the book. For example, you might see more or fewer buttons in\neach of the groups, the buttons you see might be represented by larger or smaller\nicons than those shown, or the group might be represented by a button that you\nclick to display the group’s commands.\nWhen we instruct you to give a command from the ribbon in an exercise, we do it in\nthis format:\n● On the Insert tab, in the Illustrations group, click the Chart button.\nIf the command is in a list, we give the instruction in this format:\n● On the Page Layout tab, in the Page Setup group, click the Breaks button\nand then, in the list, click Page.\nThe first time we instruct you to click a specific button in each exercise, we display\nan image of the button in the page margin to the left of the exercise step.\nIf differences between your display settings and ours cause a button on your screen to\nnot appear as shown in the book, you can easily adapt the steps to locate the command.\nFirst, click the specified tab. Then locate the specified group. If a group has been collapsed\ninto a group list or group button, click the list or button to display the group’s commands.\nFinally, look for a button that features the same icon in a larger or smaller size than that\nshown in the book. If necessary, point to buttons in the group to display their names in\nScreenTips.\nIf you prefer not to have to adapt the steps, set up your screen to match ours while you\nread and work through the exercises in the book.\nFeatures and Conventions\nof This Book\nThis book has been designed to lead you step by step through all the tasks you’re\nmost likely to want to perform in Microsoft Access 2010. If you start at the beginning\nand work your way through all the exercises, you will gain enough proficiency to be\nable to manage complex databases through Access. However, each topic is self con-\ntained. If you have worked with a previous version of Access, or if you completed all\nthe exercises and later need help remembering how to perform a procedure, the\nfollowing features of this book will help you locate specific information:\n● Detailed table of contents Scan the listing of the topics and sidebars within\neach chapter.\n● Chapter thumb tabs Easily locate the beginning of each chapter by looking\nat the colored blocks on the odd-numbered pages.\n● Topic-specific running heads Within a chapter, quickly locate a topic by looking\nat the running heads at the top of odd-numbered pages.\n● Glossary Look up the meaning of a word or the definition of a concept.\n● Keyboard Shortcuts If you prefer to work from the keyboard rather than with\na mouse, find all the shortcuts in one place.\n● Detailed index Look up specific tasks and features in the index, which has been\ncarefully crafted with the reader in mind.\nxxi\nxxii Features and Conventions of This Book\nYou can save time when reading this book by understanding how the Step by Step series\nshows exercise instructions, keys to press, buttons to click, and other information. These\nconventions are listed in the following table.\nConvention Meaning\nSET UP This paragraph preceding a step-by-step exercise indicates the practice\nfiles that you will use when working through the exercise. It also indicates\nany requirements you should attend to or actions you should take before\nbeginning the exercise.\nCLEAN UP This paragraph following a step-by-step exercise provides instructions\nfor saving and closing open files or programs before moving on to\nanother topic. It also suggests ways to reverse any changes you made\nto your computer while working through the exercise.\n1 Numbered steps guide you through hands-on exercises in each topic,\nas well as procedures in sidebars and expository text.\n2\nSee Also This paragraph directs you to more information about a topic in this\nbook or elsewhere.\nTroubleshooting This paragraph alerts you to a common problem and provides guidance\nfor fixing it.\nTip This paragraph provides a helpful hint or shortcut that makes working\nthrough a task easier.\nImportant This paragraph points out information that you need to know to\ncomplete a procedure.\nKeyboard Shortcut This paragraph provides information about an available keyboard\nshortcut for the preceding task.\nCtrl+B A plus sign (+) between two keys means that you must press those\nkeys at the same time. For example, “Press Ctrl+B” means that you\nshould hold down the Ctrl key while you press the B key.\nPictures of buttons appear in the margin the first time the button is\nused in an exercise.\nBold In exercises that begin with SET UP information, bold type displays\ntext that you should type; the names of program elements, such as\nbuttons, commands, windows, and dialog boxes; and files, folders, or\ntext that you interact with in the steps.\nUsing the Practice Files\nBefore you can complete the exercises in this book, you need to copy the book’s practice\nfiles to your computer. These practice files, and other information, can be downloaded\nfrom the book’s detail page, located at:\nhttp://go.microsoft.com/fwlink/?Linkid=192153\nDisplay the detail page in your Web browser and follow the instructions for downloading\nthe files.\nImportant The Microsoft Access 2010 program is not available from this Web site. You should\npurchase and install that program before using this book.\nThe following table lists the practice files for this book.\nChapter File\nChapter 1: GardenCompany01_start.accdb\nExplore an Access 2010 Database\nChapter 2: None\nCreate Databases and Simple Tables\nChapter 3: GardenCompany03_start.accdb\nCreate Simple Forms Logo.png\nChapter 4: GardenCompany04_start.accdb\nDisplay Data\nChapter 5: GardenCompany05_start.accdb\nCreate Simple Reports\nChapter 6: GardenCompany06_start.accdb\nMaintain Data Integrity\nChapter 7: GardenCompany07_start.accdb\nCreate Custom Forms Hydrangeas.jpg\nChapter 8: GardenCompany08_start.accdb\nCreate Queries\nChapter 9: GardenCompany09_start.accdb\nCreate Custom Reports\n(continued)\nxxiii\nxxiv Using the Practice Files\nChapter File\nChapter 10: Customers.xlsx\nImport and Export Data Employees.txt\nGardenCompany10_start.accdb\nProductsAndSuppliers.accdb\nShippers.xlsx\nChapter 11: GardenCompany11_start.accdb\nMake Databases User Friendly Icon.ico\nLogo.png\nChapter 12: GardenCompany12_start.accdb\nProtect Databases\nChapter 13: GardenCompany13_start.accdb\nCustomize Access\nYour Companion eBook\nThe eBook edition of this book allows you to:\n● Search the full text\n● Print\n● Copy and paste\nTo download your eBook, please see the instruction page at the back of this book.\nGetting Help\nEvery effort has been made to ensure the accuracy of this book. If you do run into\nproblems, please contact the sources listed in the following sections.\nGetting Help with This Book\nIf your question or issue concerns the content of this book or its practice files, please\nfirst consult the book’s errata page, which can be accessed at:\nhttp://go.microsoft.com/fwlink/?Linkid=192153\nThis page provides information about known errors and corrections to the book. If\nyou do not find your answer on the errata page, send your question or comment to\nMicrosoft Press Technical Support at:\nmspinput@microsoft.com\nGetting Help with Access 2010\nIf your question is about Microsoft Access 2010, and not about the content of this book,\nyour first recourse is the Access Help system. This system is a combination of tools and\nfiles stored on your computer when you installed Access and, if your computer is con-\nnected to the Internet, information available from the Microsoft Office Online Web site.\nYou can find general or specific Help information in the following ways:\n● To find out about an item on the screen, you can display a ScreenTip. For example, to\ndisplay a ScreenTip for a button, point to the button without clicking it. The ScreenTip\ngives the button’s name, the associated keyboard shortcut if there is one, and some-\ntimes a description of what the button does when you click it.\n● In the Access program window, you can click the Microsoft Access Help button (a\nquestion mark in a blue circle) at the right end of the ribbon to display the Access\nHelp window.\n● At the right end of the title bars of some dialog boxes is a Help button (also a question\nmark) that you can click to display the Access Help window. Sometimes, topics related\nto the functions of that dialog box are already identified in the window.\nxxv\nxxvi Getting Help\nTo practice getting help, you can work through the following exercise.\nSET UP You don’t need any practice files to complete this exercise. Start Access,\nand then follow the steps.\n1. At the right end of the ribbon, click the Microsoft Access Help button.\nThe Access Help window opens.\nYour Help window might look different from this one because the material on the\nOffice Online Web site is constantly being updated.\nTip You can maximize the window or adjust its size by dragging the handle in the\nlower-right corner. You can change the size of the font by clicking the Change Font\nSize button on the toolbar.\n2. Toward the bottom of the window, below the bulleted list under Browse Access\n2010 support, click see all.\nGetting Help xxvii\nTroubleshooting The See All link is available only if the Search option is set to one of\nthe Content From Office.com choices. If your Search option is set to one of the Content\nFrom This Computer choices, the complete list is already displayed. To switch among the\navailable Search options, click the Search arrow and then click your choice in the list.\nThe window changes to display a list of help topics.\n3. In the list of topics, click Activating Access.\nAccess Help displays a list of topics related to activating Microsoft Office programs.\nYou can click any topic to display the corresponding information.\n4. On the toolbar, click the Show Table of Contents button, and then scroll down\nthe pane that appears on the left.\nLike the table of contents in a book, the Help table of contents is organized in\nsections. If you’re connected to the Internet and the Search option is set to one of\nthe Content From Office.com choices, Access displays sections, topics, and training\navailable from the Office Online Web site as well as the Help information stored on\nyour computer.\nClicking any section (represented by a book icon) displays that section’s topics\n(represented by help icons).\nxxviii Getting Help\n5. In the Table of Contents pane, click a few sections and topics. Then click the\nBack and Forward buttons to move among the topics you have already viewed.\n6. At the right end of the Table of Contents title bar, click the Close button.\n7. At the top of the Access Help window, click the Search box, type relationships,\nand then press the Enter key.\nThe Access Help window displays topics related to the word you typed.\nNext and Back buttons appear below the search term to make it easier to search\nfor the topic you want.\nTip If you enter a term in the Search box and then click the adjacent Search arrow,\nyou can specify the type of help you are looking for or where you want to look for it.\nGetting Help xxix\n8. In the results list, click the Guide to table relationships topic.\nThe selected topic appears in the Access Help window.\n9. Below the first paragraph of the topic, click Database design basics.\nAccess jumps to the related topic about database design. This type of hyperlink is\nidentified by blue text. You might also see a Show All button that displays hidden\nauxiliary information available in the topic. (The button changes to Hide All when\nthe hidden information is displayed.)\nTip You can click the Print button on the toolbar to print a topic. Only the displayed\ninformation is printed.\nCLEAN UP Click the Close button in the upper-right corner of the Access Help\nwindow.\nMore Information\nIf your question is about Access 2010 or another Microsoft software product and you\ncannot find the answer in the product’s Help system, please search the appropriate\nproduct solution center or the Microsoft Knowledge Base at:\nsupport.microsoft.com\nIn the United States, Microsoft software product support issues not covered by the\nMicrosoft Knowledge Base are addressed by Microsoft Product Support Services.\nLocation-specific software support options are available from:\nsupport.microsoft.com/gp/selfoverview/\n\nChapter at a Glance\nCreate databases\nfrom templates,\npage 46\nCreate databases\nand tables\nmanually, page 52\nRefine table\nstructure,\npage 64\nCreate relationships\nbetween tables, page 68\n2\nCreate Databases\nand Simple Tables\nIn this chapter, you will learn how to\n✔ Create databases from templates.\n✔ Create databases and tables manually.\n✔ Manipulate table columns and rows.\n✔ Refine table structure.\n✔ Create relationships between tables.\nCreating the container for a database is easy. But an empty database is no more useful\nthan an empty document or worksheet. It is only when you fill a database with data in\ntables (known as populating a database) that it starts to serve a purpose. As you add\nforms, queries, and reports, it becomes a useful tool. If you customize it by adding a\nstartup page and organizing the various objects into categories and groups, it moves\ninto the realm of being a database application.\nNot every database has to be refined to the point that it can be classified as an application.\nDatabases that only you or a few experienced database users will work with can remain\nfairly simple. But if you expect someone without database knowledge to enter data or\ngenerate their own reports, spending a little extra time in the beginning to create a solid\nfoundation will save a lot of work later. Otherwise, you’ll find yourself continually repairing\ndamaged files or walking people through seemingly easy tasks.\nMicrosoft Access 2010 takes a lot of the difficult and mundane work out of creating and\ncustomizing a database by providing database applications in the form of templates that\nyou modify and populate with your own information. Access 2010 also provides templates\nfor common elements that you might want to plug into a database. These application\nparts consist of sets of objects—a table and related forms, queries, or reports—that\ntogether provide a complete, functioning part of a database. All you have to do is fill in\nyour data. If none of the templates meet your needs, you can create tables manually.\n45\n46 Chapter 2 Create Databases and Simple Tables\nIn this chapter, you’ll create a database from a template and create a table manually.\nThen you’ll adjust the display of a data table to fit your needs. By the end of this chapter,\nyou’ll have a database containing a few tables and you’ll understand a bit about how\nthe tables in the databases you will use for the exercises in the remaining chapters of the\nbook were created.\nPractice Files You don’t need any practice files to complete the exercises in this chapter.\nFor more information about practice file requirements, see “Using the Practice Files” at\nthe beginning of this book.\nCreating Databases from Templates\nA few years ago (the distant past, in computer time), creating a database structure involved\nfirst analyzing your needs and then laying out the database design on paper. You would\ndecide what information you needed to track and how to store it in the database. Creating\nthe database structure could be a lot of work, and after you created it and entered data,\nmaking changes could be difficult. Templates have changed this process, and committing\nyourself to a particular database structure is no longer the big decision it once was.\nA template is a pattern that you use to create a specific type of database. Access 2010\ncomes with templates for several databases typically used in business and education, and\nwhen you are connected to the Internet, many more are available from the Microsoft\nOffice Online Web site at office.microsoft.com. By using pre-packaged templates, you\ncan create a database application in far less time than it used to take to sketch the\ndesign on paper, because someone has already done the design work for you.\nUsing an Access template might not produce exactly the database application you want,\nbut it can quickly create something that you can customize to fit your needs. However, you\ncan customize a database only if you know how to manipulate its basic building blocks:\ntables, forms, queries, and reports. Due to the complexity of these templates, you probably\nshouldn’t try to modify them until you’re comfortable working with database objects in\nDesign view and Layout view. By the time you finish this book, you will know enough to be\nable to confidently work with the sophisticated pre-packaged application templates that\ncome with Access.\nIn this exercise, you’ll create a database application based on the Tasks template. This\ntemplate is typical of those provided with Microsoft Access 2010, in that it looks nice\nand demonstrates a lot of the neat things you can do in a database.\nCreating Databases from Templates 47\nSET UP You don’t need any practice files to complete this exercise. Close any open\ndatabases, and then with the New page of the Backstage view displayed, follow\nthe steps.\n1. In the Available Templates area, click Sample Templates.\nAccess displays a list of the templates that shipped with the program and are\ninstalled on your computer.\n2. Click the Tasks template icon.\nIn the right pane, you can assign a name to the database and browse to the location\nwhere you want to store the database.\nThe Tasks template is supplied with Access.\n3. In the File Name box, type MyTasks.\nTip Naming conventions for Access database files follow those for Windows files. File\nnames cannot contain the following characters: \\ / : * ? “ < > |. By default, file name\nextensions are hidden, and you shouldn’t type the extension in the File Name box.\n(The extension for an Access 2010 database file is .accdb. For information about this\nfile format, which was introduced with Access 2007, search for accdb in Access Help.)\n48 Chapter 2 Create Databases and Simple Tables\n4. Click the adjacent Browse button, and then in the File New Database dialog box,\nnavigate to your Chapter02 practice file folder.\nYou use the same navigational techniques in this dialog box that you would use in\nany Open or Save dialog box.\nThe File New Database dialog box.\n5. With Microsoft Access 2007 Databases selected in the Save as type box,\nclick OK.\nThe path to the specified folder is displayed below the File Name box.\nTip By default, Access creates new databases in your Documents folder. You can change\nthe location when you create each database, as you did here, or you can change the\ndefault save folder. To specify a different default folder, click the File tab to display\nthe Backstage view, click Options, and then on the General page of the Access Options\ndialog box, under Creating Databases, click the Browse button to the right of Default\nDatabase Folder. In the Default Database Path dialog box, browse to the folder you\nwant to be the default, and then click OK in each of the open dialog boxes.\nCreating Databases from Templates 49\n6. Click the Create button.\nAccess briefly displays a progress bar, and then the new database opens, with the\nTask List form displayed in Layout view.\nTip Below the form name is a toolbar with commands created by embedded macros.\nThese commands are an example of what makes this a database application rather\nthan a simple database. The topic of macros is beyond the scope of this book. For\ninformation, search for macros in Access Help.\n7. If the Navigation pane is closed, click the Shutter Bar Open button at the right\nend of its title bar to open it. Then if any of the groups are collapsed, click their\nchevrons to open them.\nThe Navigation pane displays a custom Tasks Navigation category.\nThe custom category has custom Tasks, Contacts, and Supporting Objects groups.\nTroubleshooting The appearance of buttons and groups on the ribbon changes depending\non the width of the program window. For information about changing the appearance of\nthe ribbon to match our screen images, see “Modifying the Display of the Ribbon” at the\nbeginning of this book.\n50 Chapter 2 Create Databases and Simple Tables\n8. In the Navigation pane, click the Tasks Navigation title bar, and then in the\ncategory and group list, click Object Type to list all the objects in this database.\n9. In the Tables group, double-click Contacts.\nThe empty Contacts table is displayed. You could now start entering data in this\ntable.\n10. Right-click the Contacts tab, and click Close All.\n11. On the Create tab of the ribbon, in the Templates group, click the Application\nParts button.\nThe Application Parts gallery appears.\nThe Application Parts gallery.\nYou can add various types of forms and several sets of related tables and other\ndatabase objects to this or any other database. These ready-made objects give\nyou a jump start on creating a fully functional database application.\n12. Click away from the gallery to close it.\n13. Continue exploring the objects that are part of the MyTasks database on\nyour own.\nCLEAN UP Close the MyTasks database.\nCreating Databases from Templates 51\nWeb Databases\nSeveral of the templates in the Sample Templates gallery and many of the templates\navailable from the Microsoft Office Online Web site are designated as Web data-\nbases. A Web database is one that is compatible with the new Web publishing\ncapabilities of Access 2010.\nIf Access Services are installed on your organization’s Microsoft SharePoint server,\nyou can now publish a database to Access Services. Publishing converts tables to\nSharePoint lists stored on the server and makes it possible to work with the data-\nbase either in Access or in a Web browser.\nYou can create a Web database based on a Web template or build a new one from\nscratch by choosing Blank Web Database on the New page of the Backstage view.\nYou can also publish a regular database as a Web database, although the tables in\nthe database must conform to Web database requirements for publication to be\nsuccessful. Because of these requirements, if you work for an organization where\nfuture deployment of Access Services is a possibility, you might want to consider\ncreating a Web database to ensure that your database can be published to Access\nServices in the future.\nIn a Web database, you can create two kinds of objects:\n● Web objects These can be created and viewed in either a Web browser\nor Access.\n● Non-Web objects These can be created and viewed only in Access.\nWhen you are working with a Web database from a browser, you are working with\nthe database on the server. When you are working with it from Access, you are\nworking with a local copy of the database that is synchronized with the database\non the server. For both types of objects, you can make design changes only in\nAccess and only when connected to the server.\nThese days, more and more companies have employees and clients in different\ngeographic locations, and more and more people are working away from company\noffices. Web databases make it possible for people to access company databases\nfrom wherever they are and from any computer, whether or not it has Access\ninstalled.\n52 Chapter 2 Create Databases and Simple Tables\nCreating Databases and Tables Manually\nSuppose you need to store different types of information for different types of people.\nFor example, you might want to maintain information about employees, customers, and\nsuppliers. In addition to the standard information—such as names, addresses, and phone\nnumbers—you might want to track these other kinds of information:\n● Employee identification numbers, hire dates, marital status, deductions, and pay rates\n● Customer orders and account status\n● Supplier contacts, current order status, and discounts\nYou could start with a template, add fields for all the different items of information to\na single Contacts table, and then fill in only the relevant fields for each type of contact.\nHowever, cramming all this information into one table would soon get pretty messy. It’s\nbetter to create a new database based on the Blank Database template and then manu-\nally create separate tables for each type of contact: employee, customer, and supplier.\nWhen you create a new blank database or insert a new table into an existing database,\nthe table is displayed on a tabbed page in Datasheet view with one empty row that is\nready to receive data. Because the active object is a table, Access adds the Table Tools\ncontextual tabs to the ribbon so that you can work with the table.\nA new table in a new database.\nCreating Databases and Tables Manually 53\nIf you close the table at this point, it will disappear, because it contains no data and it has\nno structure. The simplest way to make the table part of the database is to create at least\none record by entering data, which simultaneously defines the table’s structure.\nTip You can also define the structure of the table without entering data. For information about\ntable structure, see “Refining Table Structure” later in this chapter. For information about\nadding new blank fields to a table, see “Restricting the Type of Data” in Chapter 6, “Maintain\nData Integrity.”\nObviously, to create a record, you need to know how to enter information in Datasheet view.\nField waiting for data\nPrimary key\nRecord selector, displaying New icon\nThe first record in a new table, before data is entered.\nEvery table has an empty row that is ready to receive a new record, as indicated by the New\nicon (the asterisk) in the record selector at the left end of the row. By default, the first field\nin each new table is an ID field designed to contain an entry that will uniquely identify the\nrecord. Also by default, this field is designated as the table’s primary key. No two records\nin this table can have the same value in this primary key field. Behind the scenes, the data\ntype of this field is set to AutoNumber, so Access will enter a sequential number in this\nfield for you.\nTip As you’ll see in a later exercise, the primary key field does not have to be the default\nAutoNumber type. If you need to you create your own primary key field, then anything\nmeaningful and unique will work.\nSee Also For information about data types, see “Refining Table Structure” later in this chapter.\nThe first field you need to be concerned about is the active field labeled Click To Add.\nYou enter the first item of information for the new record in the first cell in this field,\nand then press the Tab or Enter key to move to the first cell in the field to the right.\nAccess then assigns the value 1 to the ID field, assigns the name Field1 to the second\nfield, and moves the Click To Add label to the third field. The icon in the record selector\nat the left end of the record changes to two dots and a pencil to indicate that this\nrecord has not yet been saved, and the New icon moves to the record selector of the\nnext row.\n54 Chapter 2 Create Databases and Simple Tables\nThe first record in a new table, after data has been entered in the first field.\nWhen creating a new table in Datasheet view, you need to save the first record after\nentering the first item of data. If you don’t, Access increments the ID value for each field\nyou add to that record. For example, if you add seven fields, Access assigns the value 7 to\nthe ID field of the first record. To avoid this problem, you simply click the icon in the record\nselector after you enter your first value in the first record. This saves the record with the\nvalue 1 assigned to the ID field, and subsequent records will be numbered sequentially.\nHaving entered the first item of data and saved the record, you continue entering items\nof information in consecutive cells and pressing Tab or Enter. When you finish entering the\nlast item for the first record, you click anywhere in the row below to tell Access that the\nrecord is complete.\nAfter you complete the first record of a new table, you will probably want to change the\ndefault field names to something more meaningful. To rename a field, you simply double-\nclick its field name and then type the name you want.\nAt any time while you are entering data in a new table, you can save the table by clicking\nthe Save button on the Quick Access Toolbar and naming the table. If you try to close the\ntable without explicitly saving it, Access prompts you to save the table. If you click No,\nAccess discards the table and any data you have entered.\nAfter you have saved the table for the first time, Access automatically saves each record\nwhen you move away from it. You don’t have to worry about losing your changes, but you\ndo have to remember that most data entries can be undone only by editing the record.\nDatabases almost always contain more than one table. You can create additional empty\ntables by clicking the Table button in the Tables group on the Create tab of the ribbon.\nIf you need to create a table that is similar in structure to an existing one, you can copy\nand paste the existing table to create a new one. When you paste the table, Access gives\nyou the option of naming the table and of specifying whether you want the new table to\nhave the existing table’s structure or both its structure and its data.\nCreating Databases and Tables Manually 55\nFor some kinds of tables, Access provides Quick Start fields that you can use to add\ncommon sets of fields or kinds of fields to a table. The Quick Start options take the\nwork out of defining these fields and can be very useful when you know exactly what\ntype of field you need.\nIn this exercise, you’ll create a blank database, enter information into the first record of\nits default table, assign field names, add another record, and save and close the table.\nThen you’ll copy that table to create a second one. Finally, you’ll create a new table and\nexperiment with Quick Start fields.\nSET UP You don’t need any practice files to complete this exercise. Close any open\ndatabases, and then with the New page of the Backstage view displayed, follow\nthe steps.\n1. In the center pane of the New page, in the Available Templates area, click Blank\nDatabase.\n2. In the right pane, click the File Name box, and type MyTables. Then click the\nBrowse button, navigate to your Chapter02 practice file folder, and click OK.\nTip You can’t create a blank database without saving it. If you don’t provide a file name\nand location, Access saves the file with the name Database followed by a sequential\nnumber in the default location (your Documents folder, unless you have changed it).\n3. In the right pane, click the Create button.\nAccess creates the blank database in the specified location, opens the database,\nand displays a new blank table named Table1.\n4. With the empty field below Click to Add selected, type Scott, and then press Tab\nto move to the next field.\nThe icon in the record selector changes to indicate that this record has not yet\nbeen saved. The value 1 appears in the ID field, the name of the second column\nchanges to Field1, and the Click To Add label moves to the third column.\n5. Click the icon in the record selector to save the record before you move on.\nTip Clicking the record selector is necessary only after you enter the first value in a\nnew table. This action sets the ID field value to 1.\n56 Chapter 2 Create Databases and Simple Tables\n6. Click the cell under Click to Add, and type the following information into the next\nseven cells, pressing Tab after each entry:\nGode\n612 E. 2nd\nPocatello\nID\n73204\nUSA\n208 555-0161\nAs the cursor moves to the next cell, the name of the field in which you just entered\ndata changes to Field followed by a sequential number.\nThe first complete record.\nTip Don’t be concerned if your screen does not look exactly like ours. In this graphic,\nwe’ve scrolled the page and adjusted the widths of the columns so that you can see all\nthe fields. For information about adjusting columns, see “Manipulating Table Columns\nand Rows” later in this chapter.\n7. Double-click the ID field name (not the ID value in Field5), and then type\nCustomerID to rename it.\nTip Field names can include spaces, but the spaces can affect how queries have to be\nconstructed, so it is best not to include them. For readability, capitalize each word and\nthen remove the spaces, or use underscores instead of spaces.\n8. Repeat step 7 for the other fields, changing the field names to the following:\nField1 FirstName Field4 City Field7 Country\nField2 LastName Field5 State Field8 Phone\nField3 Street Field6 ZIP\nThe table now has intuitive field names.\nCreating Databases and Tables Manually 57\nThe renamed fields.\nTip Again, don’t worry if your screen doesn’t look exactly like this graphic, because\nwe’ve made adjustments so that you can see all the fields.\n9. Add another record containing the following field values to the table, pressing Tab\nto move from field to field:\nFirstName John City Montreal Country Canada\nLastName Frederickson State Quebec Phone 514 555-0167\nStreet 43 rue St. Laurent ZIP (press Tab to skip this field)\n10. At the right end of the tab bar, click the Close button.\n11. When Access asks whether you want to save the design of the table, click Yes.\nImportant Clicking No will delete the new table and its data from the database.\nAccess displays the Save As dialog box.\nYou must save the table before closing it.\n12. In the Table Name box, type Customers, and then click OK.\nAccess closes the table, which is now listed in the Tables group on the Navigation bar.\nThe database now contains one table.\n58 Chapter 2 Create Databases and Simple Tables\nTip You can rename a table by right-clicking it in the Navigation pane and then clicking\nRename. You can delete a table by right-clicking it, clicking Delete, and then confirming\nthe deletion in the message box that appears. (You can also delete a table by selecting\nit in the Navigation bar and then clicking the Delete button in the Records group on\nthe Home tab or pressing the Delete key.)\n13. In the Navigation pane, click the Customers table to select it.\n14. On the Home tab, in the Clipboard group, click the Copy button. Then click the\nPaste button.\nKeyboard Shortcut Press Ctrl+C to copy data. Press Ctrl+V to paste data.\nSee Also For more information about keyboard shortcuts, see “Keyboard Shortcuts”\nat the end of this book.\nThe Paste Table As dialog box opens.\nIf you need to create a table that is similar to an existing table, it is sometimes easier\nto customize a copy than to create it from scratch.\n15. In the Table Name box, type Employees. In the Paste Options area, click\nStructure Only to capture the fields from the Customers table but none of\nthe customer information. Then click OK.\nThe new Employees table appears in the Navigation pane.\nTip You can also use the Copy and Paste commands to append the information in the\nselected table to another existing table. In that case, in the Paste Table As dialog box,\ntype the name of the destination table in the Table Name box, click Append Data To\nExisting Table, and then click OK.\n16. Double-click Employees to open it in Datasheet view so that you can view its\nfields. Then close the table again.\nCreating Databases and Tables Manually 59\n17. On the Create tab, in the Tables group, click the Table button.\nAccess creates a new table containing an ID field and a Click To Add field\nplaceholder.\n18. With the Click to Add field active, on the Fields contextual tab, in the Add &\nDelete group, click the More Fields button.\nThe More Fields gallery appears.\nThe Quick Start fields are at the bottom of the More Fields gallery.\n19. If necessary scroll to the bottom of the gallery, and then under Quick Start,\nclick Name.\nAccess inserts ready-made LastName and FirstName fields.\n20. Repeat steps 18 and 19 to add the Address fields from the Quick Start list.\nAccess inserts ready-made Address, City, State Province, ZIP Postal, and Country\nRegion fields.\n21. Close the table, saving it with the name Shippers when prompted.\nCLEAN UP Retain the MyTables database for use in later exercises.\n60 Chapter 2 Create Databases and Simple Tables\nDatabase Design\nIn a well-designed database, each item of data is stored only once. If you’re cap-\nturing the same information in multiple places, that is a sure sign that you need\nto analyze the data and figure out a way to put the duplicated information in a\nseparate table.\nFor example, an Orders table should not include information about the customer\nplacing each order, for two significant reasons. First, if the same customer orders\nmore than once, all his or her information has to be repeated for each order, which\ninflates the size of the table and the database. Second, if the customer moves, his\nor her address will need to be updated in the record for every order placed.\nThe way to avoid this type of problem is to put customer information in a Customers\ntable and assign each customer a unique identifier, such as a sequential number or\nunique string of letters, in the primary key field. Then in the Orders table, you can\nidentify the customer by the unique ID. If you need to know the name and address\nof the customer who placed a particular order, you can have Access use the unique\nID to look up that information in the Customers table.\nThe process of ensuring that a set of information is stored in only one place is\ncalled normalization. This process tests a database for compliance with a set of\nnormalization rules that ask questions such as “If I know the information in the\nprimary key field of a record, can I retrieve information from one and only one\nrecord?” For example, knowing that a customer’s ID is 1002 means you can pull\nthe customer’s name and address from the Customers table, whereas knowing\nthat a customer’s last name is Jones does not mean that you can pull the cus-\ntomer’s name and address from the table, because more than one customer\nmight have the last name Jones.\nThe topic of normalization is beyond the scope of this book. If you need to design\na database that will contain several tables, you should search for Database\ndesign basics in Access Help to learn more about the normalization process.\nManipulating Table Columns and Rows 61\nManipulating Table Columns and Rows\nIn Chapter 1, “Explore an Access 2010 Database,” we showed you how to quickly adjust\nthe width of table columns to efficiently display their data. In addition to adjusting column\nwidth, sometimes you might want to rearrange a table’s fields to get a better view of the\ndata. For example, if you want to look up a phone number but the names and phone\nnumbers are several fields apart, you will have to scroll the page to get the information\nyou need. You might want to rearrange or hide a few fields to be able to simultaneously\nsee the ones you are interested in.\nYou can manipulate the columns and rows of an Access table without affecting the under-\nlying data in any way. You can size rows and size, hide, move, and freeze columns. You can\nsave your table formatting so that the table will look the same the next time you open it,\nor you can discard your changes without saving them.\nIn this exercise, you’ll open a table and manipulate its columns and rows.\nSET UP You need the MyTables database you worked with in the preceding exercise\nto complete this exercise. Open the MyTables database, and then follow the steps.\n1. In the Navigation pane, double-click the Customers table to open it in\nDatasheet view.\n2. In the field name row, point to the right border of the Street field name, and\nwhen the pointer changes to a double-headed arrow, drag to the right until\nyou can see all of the street addresses.\n3. Double-click the right border of any column that seems too wide or too narrow to\nadjust the column to fit its contents.\nThis technique is particularly useful in a large table where you can’t easily determine\nthe length of a field’s longest entry.\n4. Point to the border between any two record selectors, and drag downward.\nWhen you release the mouse button, Access increases the height of all rows\nin the table.\n62 Chapter 2 Create Databases and Simple Tables\nYou cannot adjust the height of a single row.\n5. On the Home tab, in the Records group, click the More button, and then click\nRow Height.\nThe Row Height dialog box opens.\nYou can set the rows to the precise height you want.\n6. In the Row Height dialog box, select the Standard Height check box, and then\nclick OK.\nAccess resets the height of the rows to the default setting.\n7. Click anywhere in the FirstName field. Then in the Records group, click the More\nbutton, and click Hide Fields.\nThe FirstName field disappears, and the fields to its right shift to the left.\nTip If you select several fields before clicking Hide Fields, they all disappear. You can\nselect adjacent fields by clicking the field name of the first one, holding down the Shift\nkey, and then clicking the field name of the last one. The two fields and any fields in\nbetween are selected.\n8. To restore the hidden field, in the Records group, click the More button, and then\nclick Unhide Fields.\nManipulating Table Columns and Rows 63\nThe Unhide Columns dialog box opens.\nYou can select and clear check boxes to control which fields are visible.\nTip If you want to hide several columns that are not adjacent, you can display the\nUnhide Columns dialog box and clear their checkboxes.\n9. In the Unhide Columns dialog box, select the FirstName check box, and then\nclick Close.\nAccess redisplays the FirstName field.\n10. If you can see all of the fields in the table, for the purposes of this exercise, adjust\nthe size of the program window until some of the fields are no longer visible.\n11. Point to the CustomerID field name, hold down the mouse button, and drag through\nthe FirstName and LastName field names. With the three columns selected, click the\nMore button in the Records group, and then click Freeze Fields.\n12. Scroll the page to the right until the Phone field is adjacent to the LastName field.\nThe first three columns remain in view as you scroll.\n13. In the Records group, click More, and then click Unfreeze All Fields to restore the\nfields to their normal condition.\nTip The commands to hide, unhide, freeze, and unfreeze columns are also available\nfrom the shortcut menu that appears when you right-click a field name.\n64 Chapter 2 Create Databases and Simple Tables\n14. Click the Phone field name to select that field. Then drag the field to the left,\nreleasing the mouse button when the thick black line appears to the right of the\nLastName field.\n15. Close the Customers table, clicking Yes to save the changes you have made to\nthe column widths and order. If you see a warning that this action will clear the\nClipboard, click Yes.\nCLEAN UP Retain the MyTables database for use in later exercises.\nRefining Table Structure\nAlthough you can create the structure of a database in Datasheet view, some structural\nrefinements can be carried out only in Design view. When you are familiar with tables,\nyou might even want to create your tables from scratch in Design view, where you\nhave more control over the fields. You can open a new table in Design view by clicking\nthe Table Design button in the Tables group on the Create tab.\nWhen you open an existing table in Design view, the tabbed page shows the underlying\nstructure of the table.\nThe table design page.\nRefining Table Structure 65\nThis page has two parts. The top part consists of the following:\n● Selector You can click the shaded box at the left end of a row to select the entire\nfield. You can then insert a row above the selected one, delete the row (thereby\ndeleting the field), or drag the row up or down to reposition its field in the table.\nThe selector also identifies the primary key field of the table by displaying the\nPrimary Key icon (a key with a right-pointing arrow).\nTip If you don’t want a table to have a primary key (for example, if none of the fields\nwill contain a unique value for every record), select the field designated as the primary\nkey, and on the Design contextual tab, in the Tools group, click the Primary Key button\nto toggle it off. If you want to designate a different field as the primary key, select the\nnew field, and click the Primary Key button to toggle it on. (You don’t have to remove\nthe primary key from the current field first; it will happen automatically.)\n● Field Name column This column contains the names you specified when you created\nthe table. You can edit the names by using regular text-editing techniques. You can\nadd a new field by typing its name in the first empty cell in this column.\n● Data Type column This column specifies the type of data that the field can contain. By\ndefault, the ID field in a new table is assigned the AutoNumber data type, and all other\nfields are assigned the Text data type. With the exception of fields with the OLE Object\nand Attachment data types, you can change the type of any field by clicking its Data\nType entry, clicking the arrow that appears, and clicking a new data type in the list.\nThe list of data types.\nSee also For more information about data types, see “Restricting the Type of Data” in\nChapter 6, “Maintain Data Integrity.”\n● Description column This column contains an optional description of the field.\n66 Chapter 2 Create Databases and Simple Tables\nThe Field Properties area at the bottom of the design page displays the properties of the\nfield selected in the top part. Different properties are associated with different data\ntypes. They can determine such things as the number of characters allowed in a field,\nthe value inserted if the user doesn't type an entry, and whether an entry is required.\nProperties can also assess whether an entry is valid and can force the user to select\nfrom a list of values rather than typing them (with the risk of errors).\nAll fields, no matter what their data type, can be assigned a Caption property that will\nappear in the place of the field name in tables or in other database objects. For example,\nyou might want to use captions to display the names of fields with spaces, such as First\nName for the FirstName field.\nSee Also For information about using properties to control the accuracy of data entry, see\nChapter 6, “Maintain Data Integrity.” For a comprehensive list of data types and properties,\nsearch on data types in Access Help.\nIn this exercise, you’ll open a table in Design view, add and delete fields, change a data\ntype, set field sizes, and add a caption.\nSET UP You need the MyTables database you worked with in the preceding exercise\nto complete this exercise. Open the MyTables database, and then follow the steps.\n1. In the Navigation pane, right-click the Employees table, and then click Design\nView.\nAccess opens the table with its structure displayed. Because you created this table\nby copying the Customers table, you need to make some structural changes.\n2. With CustomerID highlighted in the Field Name column, type EmployeeID, and\nthen press the Tab key twice.\n3. In the Description column, type Unique identifying number.\n4. Click the Country field’s selector, and then on the Design contextual tab, in the\nTools group, click the Delete Rows button.\n5. In the empty row below the Phone field, click the Field Name cell, and type\nBirthdate. Then click the Data Type cell.\nAccess assigns the default Text data type to the new field.\n6. Click the arrow at the right end of the Data Type cell, and in the list, click\nDate/Time.\n7. Repeat steps 5 and 6 to add another Date/Time field named DateHired.\nRefining Table Structure 67\n8. Select the ZIP field name, change it to PostalCode, and then change its data type\nto Text.\nTip If you use only five-digit ZIP codes, the Number data type is fine. But setting it to\nText allows you to enter ZIP+4 codes or the letter-number postal codes used in Canada\nand other countries.\nThe properties in the Field Properties area at the bottom of the design page\nchange to those that are appropriate for this type of field.\nThe properties for the Text data type.\n9. In the box to the right of Field Size, double-click 255, and type 10.\nYou are specifying that this field can contain no more than 10 characters.\n10. Change the Field Size property of the following fields as shown:\nFirstName 50 City 50 Phone 30\nLastName 50 State 20\nTip Sometimes changing the field properties of a table that already contains data can\nproduce unanticipated results. If you make a change to a field property that might cause\ndata to be lost (for example, if you make the Field Size property smaller than one of the\nfield’s existing values), Access warns you of this problem when you attempt to save the\ntable. For more information, see Chapter 6, “Maintain Data Integrity.”\n68 Chapter 2 Create Databases and Simple Tables\n11. Click the State field. Then in the Field Properties area, click the Caption box, and\ntype State or Region.\nThe Field Name remains State, but in Datasheet view, the column heading will be\nState or Region.\nYou have changed the Field Size and Caption properties of the State field.\n12. On the Design tab, in the Views group, click the View button to switch to\nDatasheet view.\nAccess tells you that you must save the table before leaving Design view.\n13. In the message box, click Yes to save the table.\nAccess saves the table and displays it in Datasheet view.\n14. With the table displayed in Datasheet view, click the LastName field name. Then\non the Fields contextual tab, in the Add & Delete group, click the Text button.\nA new field called Field1 that has the Text data type is inserted to the right of the\nLastName field.\nTip You can also create a new field with a specific data type by clicking the Click To Add\nlabel to the right of the last field in the field name row. Then in the list that appears, you\ncan click the data type you want.\nCreating Relationships Between Tables 69\n15. With Field1 selected, type Title, and press Enter.\n16. Click the Title field name. Then in the Properties group, in the Field Size box, click\n255 to select it, type 50, and press Enter.\n17. Type the following information in the first record:\nFirstName Karen\nLastName Berg\nTitle Owner\nThe Employees table is now ready for you to start entering data.\nThe first record of the Employees table.\nCLEAN UP Close the Employees table. Retain the MyTables database for use in the\nlast exercise.\nCreating Relationships Between Tables\nIn Access, a relationship is an association between common fields in two tables. You can\nuse this association to link the primary key field in one table to a field that contains the\nsame information in another table. The field in the other table is called the foreign key.\nFor example, if customer accounts are assigned to specific sales employees, you can\nestablish a relationship by linking the primary key EmployeeID field in the Employees\ntable with the foreign key EmployeeID field in the Customers table. Each customer\naccount is assigned to only one employee, but each employee can manage many\ncustomer accounts, so this type of relationship—the most common—is known as\na one-to-many relationship.\nSimilarly, if every order is associated with a customer, you can establish a relationship\nby linking the primary key CustomerID field in the Customers table and foreign key\nCustomerID field in the Orders table. Each order is placed by only one customer, but\neach customer can place many orders. So again, this is a one-to-many relationship.\n70 Chapter 2 Create Databases and Simple Tables\nLess common relationships include:\n● One-to-one In this type of relationship, each record in one table can have one and\nonly one related record in the other table. This type of relationship isn’t commonly\nused because it is easier to put all the fields in one table. However, you might use\ntwo related tables instead of one to break up a table with many fields, or to track\ninformation that applies to only some of the records in the first table.\n● Many-to-many This type of relationship is really two one-to-many relationships\ntied together through a third table. You might see this relationship in a database\nthat contains Products, Orders, and Order Details tables. The Products table has one\nrecord for each product, and each product has a unique ProductID. The Orders table\nhas one record for each order placed, and each record in it has a unique OrderID.\nHowever, the Orders table doesn’t specify which products were included in each\norder; that information is in the Order Details table—the table in the middle that\nties the other two tables together. Products and Orders each have a one-to-many\nrelationship with Order Details. Products and Orders therefore have a many-to-\nmany relationship with each other. In plain language, this means that every product\ncan appear in many orders, and every order can include many products.\nThe most common way of creating a relationship between two tables is to add the\ntables to the Relationships page displayed when you click the Relationships button in\nthe Relationships group on the Database Tools tab. You then drag a field in one table\nto the common field in the other table and complete the relationship definition in the\nEdit Relationships dialog box. In this dialog box, you are given the opportunity to im-\npose a restriction called referential integrity on the data, which means that an entry\nwill not be allowed in one table unless it already exists in the other table.\nAfter you have created a relationship, you can delete it by deleting the line connecting\nthe tables on the Relationships page. You can clear all the boxes from the page by\nclicking the Clear Layout button in the Tools group on the Relationship Tools Design\ncontextual tab.\nCreating Relationships Between Tables 71\nTip The coverage of relationships in this topic is deliberately simple. However, relationships\nare what make relational databases tick, and Access provides a number of fairly complex\nmechanisms to ensure the integrity of the data on either end of the relationship. Some of\nthese mechanisms are covered in Chapter 6, “Maintain Data Integrity.” For a good overview,\nsearch for Guide to table relationships in Access Help.\nIn this exercise, you’ll create relationships between one table and two other tables.\nThen you’ll test the referential integrity of one of the relationships.\nSET UP You need the MyTables database you worked with in the preceding exercise\nto complete this exercise. Open the MyTables database, and then follow the steps.\n1. On the Create tab, in the Tables group, click the Table button to create a new\ntable.\nBefore we add fields to this table, let’s save it.\n2. On the Quick Access Toolbar, click the Save button, name the table Orders, and\nclick OK.\n3. To the right of Click to Add, click the arrow, and in the data type list, click\nNumber. Repeat this step to create a second field with the Number data type.\n4. Double-click Field1, and type CustomerID. Then double-click Field2, and type\nEmployeeID.\nEach order in the Orders table will be placed by one customer and will be handled\nby one employee. Let’s create relationships between the Orders table and the\nCustomers and Employees tables so that we don’t create records for orders from\ncustomers who don’t exist or that seem to have been handled by employees who\ndon’t exist.\n5. Close the Orders table.\nTip You cannot create a relationship for an open table.\n6. On the Database Tools tab, in the Relationships group, click the Relationships\nbutton.\nThe Show Table dialog box opens so that you can indicate the tables for which\nyou want to create a relationship.\nTroubleshooting If the dialog box doesn’t open automatically, click the Show Table\nbutton in the Relationships group on the Design contextual tab.\n72 Chapter 2 Create Databases and Simple Tables\nThe Tables page of the Show Table dialog box.\n7. With Customers selected on the Tables page, click Add. Then double-click\nOrders, and click Close.\nAccess displays the Relationships page and adds a Relationship Tools contextual tab\nto the ribbon.\nThe two boxes list all the fields in their respective tables.\nCreating Relationships Between Tables 73\n8. In the Customers field list, click CustomerID, and drag it down and over\nCustomerID in the Orders field list, releasing the mouse button when two\nlittle boxes, one containing a plus sign, appear below the pointer.\nThe Edit Relationships dialog box opens.\nAt the bottom of the dialog box, Access indicates that this will be a one-to-many relationship.\n9. Select the Enforce Referential Integrity check box, and then click Create.\nAccess creates the link between the primary key in the Customers table and the\nforeign key in the Orders table, and a line now connects the two field lists on\nthe Relationships page.\nThe symbols at each end of the line indicate that each Customer ID value appears only once\nin the Customers table but can appear many times in the Orders table.\n74 Chapter 2 Create Databases and Simple Tables\n10. On the Design contextual tab, in the Relationships group, click the Show Table\nbutton. Then in the Show Table dialog box, double-click the Employees table, and\nclick Close.\nAccess adds a box listing all the fields in the Employees table to the Relationships\npage.\n11. On the page, drag the title bars of the three field lists to arrange them so that\nthey are side by side and equidistant.\n12. In the Employees field list, click the EmployeeID field, and drag it down and over\nthe EmployeeID field in the Orders field list. Then in the Edit Relationships dialog\nbox, select the Enforce Referential Integrity check box, and click Create.\n13. After Access draws the relationship line between the primary key and the foreign\nkey, close the Relationships page, clicking Yes to save its layout.\n14. Open the Orders table. Then in the CustomerID field of the first record, type 11,\nand click below the record to complete it.\nAccess displays a message box telling you that you cannot add the new record to\nthe table.\nThe value in the CustomerID field in the Orders table must match a value in the primary key\nCustomerID field in the Customer table.\n15. Click OK. Then change the value to 1, and click below the record to complete it.\nThis time, Access accepts the value because there is a record with the value 1 in the\nprimary key CustomerID field of the Customers table.\nCLEAN UP Close the Orders table, and then close the My Tables database.\nKey Points 75\nKey Points\n● Access 2010 includes templates to help you create databases and application parts\nto help you add related tables and other database objects.\n● Rather than storing all information in one table, you can create different tables for\neach type of information, such as customers, orders, and suppliers.\n● You can create a simple table structure by entering data and naming fields in\nDatasheet view. You can also set the data type and certain properties.\n● You can manipulate or hide columns and rows without affecting the data.\n● In Design view, you can modify any table, whether you created it manually or as\npart of a template.\n● Data types and properties determine what data can be entered in a field, and how\nthe data will look on the screen. Caution: changing some properties might affect\nthe data.\n● You can create a relationship between the primary key field of one table and the\nforeign key field of another so that you can combine information from both tables.\nChapter at a Glance\nCreate reports by\nusing a wizard, page 122\nModify report design,\npage 129\nPreview and print\nreports, page 136\n5\nCreate Simple\nReports\nIn this chapter, you will learn how to\n✔ Create reports by using a wizard.\n✔ Modify report design.\n✔ Preview and print reports.\nLike forms, reports give people easy access to the information stored in a database.\nHowever, there are several differences between forms and reports, including the following:\n● Forms are used to enter, view, and edit information. Reports are used only to view\ninformation.\n● Forms are usually displayed on-screen. Reports can be previewed on the screen,\nbut they are usually printed.\n● Forms generally provide a detailed look at records and are usually for the people who\nactually work with the database. Reports are often used to group and summarize\ndata, and are often for people who don’t work with the database but who use the\ninformation stored in the database for other business tasks.\nReports usually present summaries of larger bodies of information. For example, your\ndatabase might hold detailed information about thousands of orders. If you want to edit\nthose orders or enter new ones, you can do so directly in the table or through a form.\nIf you want to summarize those orders to illustrate the rate of growth of the company’s\nsales, you generate a report.\nLike a book report or an annual report of a company’s activities, a report created in\nMicrosoft Access 2010 is typically used to summarize and organize information to\nexpress a particular point of view to a specific audience. When you are designing a\nreport, it is important to consider the point you are trying to make, the intended\naudience, and the level of information they will need.\n121\n122 Chapter 5 Create Simple Reports\nIn this chapter, you’ll create a report by using a wizard. After modifying the layout and\ncontent of the report, you’ll see how it will look when printed.\nPractice Files Before you can complete the exercises in this chapter, you need to copy\nthe book’s practice files to your computer. The practice file you’ll use to complete the\nexercises in this chapter is in the Chapter05 practice file folder. A complete list of\npractice files is provided in “Using the Practice Files” at the beginning of this book.\nCreating Reports by Using a Wizard\nYou can divide the content of an Access report into two general categories: information\nderived from records in one or more tables, and everything else. The everything else\ncategory includes the title, page headers and footers, introductory and explanatory text,\nand any logos and other graphics.\nJust as you can create a form that includes all the fields in a table by using the Form\ntool, you can create a report that includes all the fields by using the Report tool, which\nis located in the Reports group on the Create tab. But such a report is merely a prettier\nversion of the table, and it does not summarize the data in any meaningful way. You are\nmore likely to want to create a report based on only some of the fields, and that is a job\nfor the Report wizard.\nTip In addition to basing a report on a table, you can base it on the datasheet created when\nyou run a query. For information about queries, see Chapter 8, “Create Queries.”\nThe Report wizard leads you through a series of questions and then creates a report based\non your answers. So the first step in creating a report is to consider the end result you want\nand what information you need to include in the report to achieve that result. After you\nprovide that information, the wizard creates a simple report layout and adds a text box\ncontrol and its associated label for each field you specify.\nFor example, you might want to use a Products table as the basis for a report that groups\nproducts by category. When you give the grouping instruction to the wizard, it first sorts\nthe table based on the category, and then sorts the products in each category. In the\nspace at the top of each group (called the group header), the wizard inserts the name of\nthe category.\nIn this exercise, you’ll use the Report wizard to create a simple report that displays an\nalphabetical list of products.\nCreating Reports by Using a Wizard 123\nSET UP You need the GardenCompany05_start database located in your Chapter05\npractice file folder to complete this exercise. Open the GardenCompany05_start\ndatabase, and save it as GardenCompany05. Then follow the steps.\n1. With All Access Objects displayed in the Navigation pane, under Tables, click\n(don’t double-click) Categories.\n2. On the Create tab, in the Reports group, click the Report button.\nAccess creates a report based on all the fields in the Categories table, displays the\nreport in Layout view, and adds four Report Layout Tools contextual tabs to the\nribbon.\nThe default report created by the Report tool.\nTroubleshooting The appearance of buttons and groups on the ribbon changes depending\non the width of the program window. For information about changing the appearance of\nthe ribbon to match our screen images, see “Modifying the Display of the Ribbon” at the\nbeginning of this book.\n124 Chapter 5 Create Simple Reports\n3. This is not the report we want, so close the Categories report, clicking No when\nprompted to save it.\n4. On the Create tab, in the Reports group, click the Report Wizard button.\nThe Report wizard starts. Because the Categories table is still selected in the\nNavigation pane, that table is specified in the Tables/Queries box and its fields\nare listed in the Available Fields box.\n5. Display the Tables/Queries list, and then click Table: Products.\nThe Available Fields box now lists the fields in the Products table.\nThe first page of the Report wizard with the correct table selected.\n6. In the Available Fields list, double-click ProductName, QuantityPerUnit, and\nUnitsInStock to move them to the Selected Fields box.\nTip Fields appear in a report in the order in which they appear in the Selected Fields list.\nYou can save yourself the effort of rearranging the fields in the report by entering them\nin the desired order in the wizard.\nCreating Reports by Using a Wizard 125\n7. At the bottom of the page, click Next.\nThe wizard asks whether you want to group the records. When you group by a\nfield, the report inserts a group header at the top of each group of records that\nhave the same value in that field.\n8. In the field list on the left, double-click ProductName.\nIn the preview pane on the right, the wizard moves ProductName into the group\nheader area to show that records will be grouped by this field.\n9. In the lower-left corner of the page, click Grouping Options.\nThe Grouping Intervals dialog box opens.\nYou can refine the grouping specification in this dialog box.\n10. Display the Grouping intervals list, click 1st Letter, and then click OK.\nThe group header now indicates the grouping interval you have assigned to the\ngrouping field.\n126 Chapter 5 Create Simple Reports\nThe types of grouping intervals available vary depending on the data type of the field by\nwhich you are grouping records.\n11. Click Next.\nThe wizard asks how you want to sort and summarize the records.\nYou can sort by up to four fields, each in ascending or descending order.\nCreating Reports by Using a Wizard 127\nTip For any field that contains numeric information, you can click Summary Options\nnear the bottom of the wizard page to display the Summary Options dialog box, where\nyou can instruct Access to insert a group footer in the report and to display the sum,\naverage, minimum, or maximum value for the field. The only numeric field in this report\nis UnitsInStock, and it is not appropriate to summarize that field.\n12. Click the arrow to the right of the 1 box to display a list of fields, and click\nProductName. Then click Next.\nThe wizard asks which of three layouts and which orientation you want for this\nreport.\nThe preview on the left shows the effect of the options on the right.\n13. In the Layout area, click each option in turn to see a preview in the report thumbnail\nto the left.\n14. When you have finished exploring, click Outline.\n15. With Portrait selected in the Orientation area and the Adjust the field width so\nall fields fit on a page check box selected, click Next.\nThe wizard prompts you to supply a title for the report.\n128 Chapter 5 Create Simple Reports\nFor ease of use, you should make the title more specific.\n16. In the title box, type Alphabetical List of Products, and then with Preview the\nreport selected, click Finish.\nAccess creates the report and displays it in Print Preview.\nThe new report in Print Preview.\n17. Page through the nine-page report, noticing how it is arranged. Then close it.\nCLEAN UP Retain the GardenCompany05 database for use in later exercises.\nModifying Report Design 129\nModifying Report Design\nYou can use the Report wizard to get a quick start on a report, but you will frequently want\nto modify the report to get the result you need. As with forms, the report consists of text\nbox controls that are bound to the corresponding fields in the underlying table and their\nassociated labels. You can add labels, text boxes, images, and other controls, and you can\nformat them, either by using commands on the ribbon or by setting their properties in\nthe report’s Property Sheet.\nTip Property Sheets for reports work the same way as those for forms. For information, see\n“Changing the Look of Forms” in Chapter 3, “Create Simple Forms.”\nYou can adjust the layout and content of reports in either Layout view or Design view.\nFor simple adjustments, it is easier to work in Layout view, where you can see the layout\nwith live data, making the process more intuitive.\nSee Also For information about creating and modifying reports in Design view, see Chapter 9,\n“Create Custom Reports.”\nTip Automatic error checking identifies common errors in forms and reports and gives you a\nchance to fix them. For example, Access informs you if a report is wider than the page it will\nbe printed on. Error checking is turned on by default. If you want to turn it off, display the\nBackstage view, and click Options to open the Access Options dialog box. In the left pane,\nclick Object Designers, clear the error-checking check boxes at the bottom of the page, and\nthen click OK.\nIn this exercise, you’ll modify the layout of a report. You’ll then apply a theme, change\nsome of the colors, and dress up the text with character formatting. You will also apply\na simple rule that formats values differently if they meet a specific criterion.\nSET UP You need the GardenCompany05 database you worked with in the preceding\nexercise to complete this exercise. Open the GardenCompany05 database, and then\nfollow the steps.\n1. In the Navigation pane, under Reports, right-click the Alphabetical List of\nProducts report, and then click Print Preview.\n2. Maximize the program window if it isn’t already maximized, and then point to\nthe previewed report page.\nThe pointer changes to a magnifying glass with a plus sign in it.\n130 Chapter 5 Create Simple Reports\nIn Print Preview, the magnifying glass pointer indicates that you can zoom in on the page.\n3. Click the previewed page once to zoom in.\nTip You can also zoom in and out by dragging the Zoom slider in the lower-right corner\nof the program window. The current zoom level appears to the left of the slider.\nNotice that the report has the following design problems:\n❍ Extraneous text\n❍ Spacey arrangement\n❍ Uninviting formatting\nTo fix these problems, we need to switch to Layout view.\n4. On the View Shortcuts toolbar, click the Layout View button.\nAccess adds four Report Layout Tools contextual tabs to the ribbon. First let’s work\nwith the group header controls.\nModifying Report Design 131\n5. On the Design contextual tab, in the Grouping & Totals group, click the Hide\nDetails button.\nThe controls that are bound to fields in the Products table are hidden so that you\ncan concentrate on the group header controls.\n6. Below the title, click ProductName by 1s, and press the Delete key.\nThe label is removed from all the group headers.\n7. Click the control containing A, and drag it to the left edge of the header.\nWhen you release the mouse button, all the corresponding controls move to the\ncorresponding location in their own group headers.\nKeyboard Shortcut Hold down the Alt key and press the Arrow keys to move the\nselected control in small increments. When the shadow box is positioned where you\nwant it, click away from the control.\nSee Also For more information about keyboard shortcuts, see “Keyboard Shortcuts” at\nthe end of this book.\n8. Point to the right border of the selected A control, and when the pointer changes\nto a double-headed arrow, drag to the left until the control is just big enough to\nhold its contents.\nAgain, all the corresponding controls assume the new size.\nIt is easier to work with the controls in the group header when the report details are hidden.\n132 Chapter 5 Create Simple Reports\n9. With the A control still selected, hold down the Shift key, and in turn, click the\nProduct Name, Quantity Per Unit, and Units In Stock label controls to add\nthem to the selection.\n10. On the Design tab, in the Tools group, click the Property Sheet button.\nThe Property Sheet opens.\nBecause more than one control is selected, the Selection Type of this Property Sheet is\nMultiple Selection.\n11. On the Format page of the Property Sheet, in the Top property box, type 0.25”,\nand press Enter. Then close the Property Sheet.\nIn the group header, the letter control and label controls are now aligned 0.25 inch\nfrom the top of the header, and the height of the header has decreased because less\nspace is needed to accommodate the controls.\nModifying Report Design 133\nNow let’s see how the group header looks with its data.\n12. In the Grouping & Totals group, click the Hide Details button to turn it off and\ndisplay the data from the table.\nThe numbers in the Units In Stock column are right-aligned. Let’s center them.\n13. Click the first text box control under the Units In Stock label, and on the Format\ncontextual tab, in the Font group, click the Center button.\nNow we’ll add some color and format the text.\n14. On the Design contextual tab, in the Themes group, click the Themes button, and\nin the gallery, click the Austin thumbnail.\nAlthough nothing much appears to change, the report takes on the color scheme\nand font scheme assigned to the selected theme.\n15. Inside the shaded area of the report header, but away from the title, click a blank\narea. On the Format contextual tab, in the Control Formatting group, click the\nShape Fill button. Then under Theme Colors in the palette, click the third box\n(Light Green, Background 2).\nWhen you created this report, alternate group headers were shaded with the\nsame color as alternate data rows. This coloring confuses rather than clarifies the\nreport structure. Let’s turn off this alternate group header color.\n16. Click outside the dotted border to the left of the first group header. In the Back-\nground group, click the Alternate Row Color arrow, and at the bottom of the\npalette, click No Color.\n17. In the Control Formatting group, click the Shape Fill button, and in the palette,\nclick a light brown color.\nThe entire group header is shaded except the alphabet controls (A, B, C, and so on)\nthat you moved earlier. If you wanted to shade them as well, you could select one\nof them and repeat step 17 to apply the light brown fill.\n18. Click outside the dotted border to the left of the first row of data in the report, and\nremove the alternate row color of the data rows. Then click the white space above\nthe report header to see the result.\nOnly the backgrounds of the report header and group headers are now colored.\n134 Chapter 5 Create Simple Reports\nRemoving the alternate row color makes the structure of this report more obvious.\nTip Above the first object and below the last object of a report in Layout view are\nthe only places you can click that don’t select at least one object on the report.\n19. Click any control, and then in the Selection group, click the Select All button.\nKeyboard Shortcut Press Ctrl+A to select all the controls.\n20. In the Font group, click the Font Size arrow, and then click 9.\nTip It is usually most efficient to change the character formatting of all the controls\nand then adjust the ones you want to be different.\n21. Click the report’s title control, and then use the commands in the Font group\nto make the text 24 points, bold, and dark green.\n22. Select the controls in the group header, and make them bold and dark green.\n23. Scroll down the report, noticing that a few of the values in the Units In Stock\ncolumn are 0.\nWe want these values to stand out in the report to remind buyers that it is time\nto order more of these products.\n24. Click any control in the Units In Stock column. Then in the Control Formatting\ngroup, click the Conditional Formatting button.\nThe Conditional Formatting Rules Manager dialog box opens.\n25. Click New Rule.\nModifying Report Design 135\nThe New Formatting Rule dialog box opens.\nYou can create rules that compare the current field value to a specific value or to other values\nin the same field.\n26. With Check values in the current record or use an expression selected as the\nrule type, in the Format only cells where the area, click the arrow for the second\nbox, and click less than. Then in the third box, type 1.\n27. In the bottom area, click the Bold button, and change the Font color setting to\nred. Then click OK.\nIn the Conditional Formatting Rules Manager dialog box, the rule is listed in the\nRule column with the formatting that will be applied to values that meet the rule’s\ncriteria in the Format column.\nValues that are less than 1 will be bold and red.\n136 Chapter 5 Create Simple Reports\n28. Click OK. Then scroll down the report again, noticing that all the 0 values are\nnow bold and red.\n29. Close the report, clicking Yes to save your changes to its design.\nCLEAN UP Retain the GardenCompany05 database for use in the last exercise.\nPreviewing and Printing Reports\nUsing Print Preview to preview Access reports is very similar to using this view in other\nMicrosoft Office 2010 programs. If you preview your reports carefully, you won’t have\nany major surprises when you print them.\nWhen previewing reports, you will want to pay special attention to how the pages break.\nIn a grouped report, you can control whether group headings are allowed to appear at the\nbottom of a page with no data and whether groups are allowed to break across pages.\nYou can make changes to the setup of your report pages from the Page Setup contex-\ntual tab in Layout view or from the tab displayed when you switch to Print Preview. For\nexample, you can specify the following:\n● Paper size\n● Margins\n● Orientation\n● Number of columns\n● Whether Access should print the report's structural elements or only its data\nYou can also click the Page Setup button to display the Page Setup dialog box, where you\ncan change all these settings in one place, as well as make additional refinements.\nWhen you are ready to print, you click the Print button on the Print Preview tab of the rib-\nbon to display the Print dialog box. You can also display the Print page of the Backstage\nview and then print one copy of the report with the default print settings by clicking the\nQuick Print button.\nIn this exercise, you’ll preview a report, and you’ll specify that groups should not break\nacross pages. Then you’ll explore the available page setup and printing options.\nSET UP You need the GardenCompany05 database you worked with in the preceding\nexercise to complete this exercise. Open the GardenCompany05 database, and then\nfollow the steps.\n1. In the Navigation pane, right click the Alphabetical List of Products report, and\nthen click Print Preview.\nPreviewing and Printing Reports 137\nOnly the Print Preview tab appears on the ribbon.\n2. On the page navigation bar at the bottom of the window, click the Next Page\nbutton repeatedly to view each page of this report.\nBecause of the changes you made to the report in the previous exercise, the report\nis now six pages. Several of the groups start on one page and continue on the next\npage. For readability, let’s fix this layout problem.\nThe group at the top of this page is a continuation of one that started\non the previous page.\n3. Switch to Layout view, and then on the Design tab, in the Grouping & Totals\ngroup, click the Group & Sort button.\nThe Group, Sort, And Total pane opens at the bottom of the report page.\nYou can use this pane to quickly add grouping and sorting levels and set related properties.\n4. In the Group, Sort, and Total pane, in the Group on ProductName bar, click More.\n138 Chapter 5 Create Simple Reports\nAccess displays additional options.\nThese are the current grouping settings.\n5. Click the do not keep group together on one page arrow, and in the list, click\nkeep whole group together on one page. Then close the Group, Sort, and\nTotal pane by clicking the Group & Sort button again.\n6. Switch to Print Preview, and page through the report.\nNow none of the groups is broken across pages. However, the report would look\nbetter with wider top, left, and right margins.\n7. On the Print Preview tab, in the Page Layout group, click the Page Setup button.\nThe Page Setup dialog box opens.\nThe Print Options page of the Page Setup dialog box.\nKey Points 139\n8. Click the Page tab, and verify that the paper size is Letter.\n9. Return to the Print Options page, and change the Top, Left, and Right margins to\n0.75. Then click OK.\n10. Scroll through the report to see the results.\nAlthough all the data in the report fits on the page, the page number in the footer\nis set too far to the right and is producing extra pages.\n11. Switch to Layout view, scroll down to the bottom of the report, and then scroll to\nthe right until you can see the page number.\n12. Click the page number control, and move and resize it so that it aligns approximately\nwith the Units In Stock column heading.\n13. Switch to Print Preview, and page through the report.\nThe report now fits neatly on seven pages.\n14. If you want, print the report by using the same techniques you would use to print\nany database object.\n15. Close the report, clicking Yes to save your changes.\nCLEAN UP Close the GardenCompany05 database.\nKey Points\n● When designing a report, consider the point you are trying to make, the intended\naudience, and the level of detail needed.\n● You can create a report that displays only some of the fields in a table by using the\nReport wizard. The report can be sorted and grouped to summarize the data in a\ntable in a meaningful way.\n● You can refine a report in Layout view by manipulating its controls and setting\nits properties. You can also format the controls to structure and highlight data.\n● In Print Preview, you can see how the report will look when printed and make\nadjustments before you print."
    }
]